/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8)
                .offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

impl<T> ::core::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::core::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::core::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::core::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::core::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::core::cmp::Eq for __BindgenUnionField<T> {}
pub const BCH_ACCOUNTING_MAX_COUNTERS: u32 = 3;
pub const BCH_SB_LABEL_SIZE: u32 = 32;
pub const BCH_LRU_BUCKET_FRAGMENTATION: u32 = 65535;
pub const BCH_LRU_STRIPE_FRAGMENTATION: u32 = 65534;
pub const BCH_ALLOC_V4_U64s_V0: u32 = 6;
pub const BCH_EXTENT_ENTRY_MAX: u32 = 9;
pub const BCH_DT_MAX: u32 = 17;
pub const BCH_NAME_MAX: u32 = 512;
pub const BCH_SB_MEMBERS_MAX: u32 = 256;
pub const BCH_SB_MEMBER_INVALID: u32 = 255;
pub const BCH_MIN_NR_NBUCKETS: u32 = 512;
pub const BCH_MI_BTREE_BITMAP_SHIFT_MAX: u32 = 58;
pub const BCH_MEMBER_V1_BYTES: u32 = 56;
pub const BCH_SB_SECTOR: u32 = 8;
pub const BCH_SB_LAYOUT_SIZE_BITS_MAX: u32 = 16;
pub const BCH_SB_LAYOUT_SECTOR: u32 = 7;
pub const BCH_SB_EXTENT_BP_SHIFT_DEFAULT: u32 = 10;
pub const BCH_REPLICAS_MAX: u32 = 4;
pub const BCH_BKEY_PTRS_MAX: u32 = 16;
pub const BCH_JOURNAL_BUCKETS_MIN: u32 = 8;
pub const BCH_WATERMARK_BITS: u32 = 3;
pub const BCH_WATERMARK_MASK: u32 = 7;
pub const BTREE_ITER_INITIAL: u32 = 64;
pub const BTREE_ITER_NORMAL_LIMIT: u32 = 256;
pub const BTREE_ITER_MAX: u32 = 1024;
pub const BCH_TRANSACTIONS_NR: u32 = 128;
pub const BCH_FORCE_IF_DATA_LOST: u32 = 1;
pub const BCH_FORCE_IF_METADATA_LOST: u32 = 2;
pub const BCH_FORCE_IF_DATA_DEGRADED: u32 = 4;
pub const BCH_FORCE_IF_METADATA_DEGRADED: u32 = 8;
pub const BCH_FORCE_IF_LOST: u32 = 3;
pub const BCH_FORCE_IF_DEGRADED: u32 = 12;
pub const BCH_BY_INDEX: u32 = 16;
pub const BCH_READ_DEV: u32 = 32;
pub const BCH_SUBVOL_SNAPSHOT_CREATE: u32 = 1;
pub const BCH_SUBVOL_SNAPSHOT_RO: u32 = 2;
pub const BCH_IOCTL_QUERY_COUNTERS_MOUNT: u32 = 1;
pub const BCH_PREAD_RAW_no_poison_check: u32 = 1;
pub const BCH_PREAD_RAW_ERR_checksum: u32 = 1;
pub const BCH_PREAD_RAW_ERR_io: u32 = 2;
pub const BCH_PREAD_RAW_ERR_decompression: u32 = 4;
pub const BCH_PREAD_RAW_ERR_ec_reconstruct: u32 = 8;
pub const BCH_SB_READ_SCRATCH_BUF_SIZE: u32 = 4096;
pub const BCH_READ_ERR_checksum: u32 = 1;
pub const BCH_READ_ERR_io: u32 = 2;
pub const BCH_READ_ERR_decompression: u32 = 4;
pub const BCH_READ_ERR_ec_reconstruct: u32 = 8;
pub const BCH_CREATE_TMPFILE: u32 = 1;
pub const BCH_CREATE_SUBVOL: u32 = 2;
pub const BCH_CREATE_SNAPSHOT: u32 = 4;
pub const BCH_CREATE_SNAPSHOT_RO: u32 = 8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct genradix_root {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __genradix {
    pub root: *mut genradix_root,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __genradix"][::core::mem::size_of::<__genradix>() - 8usize];
    ["Alignment of __genradix"][::core::mem::align_of::<__genradix>() - 8usize];
    [
        "Offset of field: __genradix::root",
    ][::core::mem::offset_of!(__genradix, root) - 0usize];
};
impl Default for __genradix {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct genradix_node {
    pub __bindgen_anon_1: genradix_node__bindgen_ty_1,
}
#[repr(C)]
pub struct genradix_node__bindgen_ty_1 {
    pub children: __BindgenUnionField<[*mut genradix_node; 64usize]>,
    pub data: __BindgenUnionField<[u8_; 512usize]>,
    pub bindgen_union_field: [u64; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of genradix_node__bindgen_ty_1",
    ][::core::mem::size_of::<genradix_node__bindgen_ty_1>() - 512usize];
    [
        "Alignment of genradix_node__bindgen_ty_1",
    ][::core::mem::align_of::<genradix_node__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: genradix_node__bindgen_ty_1::children",
    ][::core::mem::offset_of!(genradix_node__bindgen_ty_1, children) - 0usize];
    [
        "Offset of field: genradix_node__bindgen_ty_1::data",
    ][::core::mem::offset_of!(genradix_node__bindgen_ty_1, data) - 0usize];
};
impl Default for genradix_node__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of genradix_node"][::core::mem::size_of::<genradix_node>() - 512usize];
    ["Alignment of genradix_node"][::core::mem::align_of::<genradix_node>() - 8usize];
};
impl Default for genradix_node {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct genradix_iter {
    pub offset: usize,
    pub pos: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of genradix_iter"][::core::mem::size_of::<genradix_iter>() - 16usize];
    ["Alignment of genradix_iter"][::core::mem::align_of::<genradix_iter>() - 8usize];
    [
        "Offset of field: genradix_iter::offset",
    ][::core::mem::offset_of!(genradix_iter, offset) - 0usize];
    [
        "Offset of field: genradix_iter::pos",
    ][::core::mem::offset_of!(genradix_iter, pos) - 8usize];
};
pub type closure_fn = ::core::option::Option<
    unsafe extern "C" fn(arg1: *mut work_struct),
>;
#[repr(C)]
pub struct closure_waitlist {
    pub list: llist_head,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of closure_waitlist"][::core::mem::size_of::<closure_waitlist>() - 8usize];
    [
        "Alignment of closure_waitlist",
    ][::core::mem::align_of::<closure_waitlist>() - 8usize];
    [
        "Offset of field: closure_waitlist::list",
    ][::core::mem::offset_of!(closure_waitlist, list) - 0usize];
};
impl Default for closure_waitlist {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct closure {
    pub __bindgen_anon_1: closure__bindgen_ty_1,
    pub parent: *mut closure,
    pub remaining: atomic_t,
}
#[repr(C)]
pub struct closure__bindgen_ty_1 {
    pub __bindgen_anon_1: __BindgenUnionField<closure__bindgen_ty_1__bindgen_ty_1>,
    pub work: __BindgenUnionField<work_struct>,
    pub bindgen_union_field: [u64; 4usize],
}
#[repr(C)]
pub struct closure__bindgen_ty_1__bindgen_ty_1 {
    pub wq: *mut workqueue_struct,
    pub sleeper: *mut task_struct,
    pub list: llist_node,
    pub fn_: closure_fn,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of closure__bindgen_ty_1__bindgen_ty_1",
    ][::core::mem::size_of::<closure__bindgen_ty_1__bindgen_ty_1>() - 32usize];
    [
        "Alignment of closure__bindgen_ty_1__bindgen_ty_1",
    ][::core::mem::align_of::<closure__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: closure__bindgen_ty_1__bindgen_ty_1::wq",
    ][::core::mem::offset_of!(closure__bindgen_ty_1__bindgen_ty_1, wq) - 0usize];
    [
        "Offset of field: closure__bindgen_ty_1__bindgen_ty_1::sleeper",
    ][::core::mem::offset_of!(closure__bindgen_ty_1__bindgen_ty_1, sleeper) - 8usize];
    [
        "Offset of field: closure__bindgen_ty_1__bindgen_ty_1::list",
    ][::core::mem::offset_of!(closure__bindgen_ty_1__bindgen_ty_1, list) - 16usize];
    [
        "Offset of field: closure__bindgen_ty_1__bindgen_ty_1::fn_",
    ][::core::mem::offset_of!(closure__bindgen_ty_1__bindgen_ty_1, fn_) - 24usize];
};
impl Default for closure__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of closure__bindgen_ty_1",
    ][::core::mem::size_of::<closure__bindgen_ty_1>() - 32usize];
    [
        "Alignment of closure__bindgen_ty_1",
    ][::core::mem::align_of::<closure__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: closure__bindgen_ty_1::work",
    ][::core::mem::offset_of!(closure__bindgen_ty_1, work) - 0usize];
};
impl Default for closure__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of closure"][::core::mem::size_of::<closure>() - 48usize];
    ["Alignment of closure"][::core::mem::align_of::<closure>() - 8usize];
    [
        "Offset of field: closure::parent",
    ][::core::mem::offset_of!(closure, parent) - 32usize];
    [
        "Offset of field: closure::remaining",
    ][::core::mem::offset_of!(closure, remaining) - 40usize];
};
impl Default for closure {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn bch2_closure_sub(cl: *mut closure, v: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn __bch2_closure_wake_up(list: *mut closure_waitlist);
}
unsafe extern "C" {
    pub fn bch2_closure_wait(list: *mut closure_waitlist, cl: *mut closure) -> bool_;
}
unsafe extern "C" {
    pub fn __bch2_closure_sync(cl: *mut closure);
}
unsafe extern "C" {
    pub fn __bch2_closure_sync_timeout(
        cl: *mut closure,
        timeout: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_closure_sync_unbounded(arg1: *mut closure);
}
unsafe extern "C" {
    #[link_name = "bch2_closure_debug_create__extern"]
    pub fn bch2_closure_debug_create(cl: *mut closure);
}
unsafe extern "C" {
    pub fn bch2_closure_return_sync(cl: *mut closure);
}
#[repr(C)]
pub struct mean_and_variance {
    pub n: s64,
    pub sum: s64,
    pub median: s64,
    pub mad: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mean_and_variance"][::core::mem::size_of::<mean_and_variance>() - 32usize];
    [
        "Alignment of mean_and_variance",
    ][::core::mem::align_of::<mean_and_variance>() - 8usize];
    [
        "Offset of field: mean_and_variance::n",
    ][::core::mem::offset_of!(mean_and_variance, n) - 0usize];
    [
        "Offset of field: mean_and_variance::sum",
    ][::core::mem::offset_of!(mean_and_variance, sum) - 8usize];
    [
        "Offset of field: mean_and_variance::median",
    ][::core::mem::offset_of!(mean_and_variance, median) - 16usize];
    [
        "Offset of field: mean_and_variance::mad",
    ][::core::mem::offset_of!(mean_and_variance, mad) - 24usize];
};
impl Default for mean_and_variance {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct darray_char {
    pub nr: usize,
    pub size: usize,
    pub data: *mut ::core::ffi::c_char,
    pub preallocated: __IncompleteArrayField<::core::ffi::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of darray_char"][::core::mem::size_of::<darray_char>() - 24usize];
    ["Alignment of darray_char"][::core::mem::align_of::<darray_char>() - 8usize];
    [
        "Offset of field: darray_char::nr",
    ][::core::mem::offset_of!(darray_char, nr) - 0usize];
    [
        "Offset of field: darray_char::size",
    ][::core::mem::offset_of!(darray_char, size) - 8usize];
    [
        "Offset of field: darray_char::data",
    ][::core::mem::offset_of!(darray_char, data) - 16usize];
    [
        "Offset of field: darray_char::preallocated",
    ][::core::mem::offset_of!(darray_char, preallocated) - 24usize];
};
impl Default for darray_char {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct darray_u64 {
    pub nr: usize,
    pub size: usize,
    pub data: *mut u64_,
    pub preallocated: __IncompleteArrayField<u64_>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of darray_u64"][::core::mem::size_of::<darray_u64>() - 24usize];
    ["Alignment of darray_u64"][::core::mem::align_of::<darray_u64>() - 8usize];
    [
        "Offset of field: darray_u64::nr",
    ][::core::mem::offset_of!(darray_u64, nr) - 0usize];
    [
        "Offset of field: darray_u64::size",
    ][::core::mem::offset_of!(darray_u64, size) - 8usize];
    [
        "Offset of field: darray_u64::data",
    ][::core::mem::offset_of!(darray_u64, data) - 16usize];
    [
        "Offset of field: darray_u64::preallocated",
    ][::core::mem::offset_of!(darray_u64, preallocated) - 24usize];
};
impl Default for darray_u64 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct darray_const_str {
    pub nr: usize,
    pub size: usize,
    pub data: *mut *const ::core::ffi::c_char,
    pub preallocated: __IncompleteArrayField<*const ::core::ffi::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of darray_const_str"][::core::mem::size_of::<darray_const_str>() - 24usize];
    [
        "Alignment of darray_const_str",
    ][::core::mem::align_of::<darray_const_str>() - 8usize];
    [
        "Offset of field: darray_const_str::nr",
    ][::core::mem::offset_of!(darray_const_str, nr) - 0usize];
    [
        "Offset of field: darray_const_str::size",
    ][::core::mem::offset_of!(darray_const_str, size) - 8usize];
    [
        "Offset of field: darray_const_str::data",
    ][::core::mem::offset_of!(darray_const_str, data) - 16usize];
    [
        "Offset of field: darray_const_str::preallocated",
    ][::core::mem::offset_of!(darray_const_str, preallocated) - 24usize];
};
impl Default for darray_const_str {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn __bch2_darray_resize_noprof(
        arg1: *mut darray_char,
        arg2: usize,
        arg3: usize,
        arg4: gfp_t,
        arg5: bool_,
        arg6: bool_,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
pub struct time_unit {
    pub name: *const ::core::ffi::c_char,
    pub nsecs: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of time_unit"][::core::mem::size_of::<time_unit>() - 16usize];
    ["Alignment of time_unit"][::core::mem::align_of::<time_unit>() - 8usize];
    [
        "Offset of field: time_unit::name",
    ][::core::mem::offset_of!(time_unit, name) - 0usize];
    [
        "Offset of field: time_unit::nsecs",
    ][::core::mem::offset_of!(time_unit, nsecs) - 8usize];
};
impl Default for time_unit {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn bch2_pick_time_units(ns: u64_) -> *const time_unit;
}
#[repr(C)]
pub struct quantiles {
    pub entries: [quantiles_quantile_entry; 15usize],
}
#[repr(C)]
pub struct quantiles_quantile_entry {
    pub m: u64_,
    pub step: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of quantiles_quantile_entry",
    ][::core::mem::size_of::<quantiles_quantile_entry>() - 16usize];
    [
        "Alignment of quantiles_quantile_entry",
    ][::core::mem::align_of::<quantiles_quantile_entry>() - 8usize];
    [
        "Offset of field: quantiles_quantile_entry::m",
    ][::core::mem::offset_of!(quantiles_quantile_entry, m) - 0usize];
    [
        "Offset of field: quantiles_quantile_entry::step",
    ][::core::mem::offset_of!(quantiles_quantile_entry, step) - 8usize];
};
impl Default for quantiles_quantile_entry {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of quantiles"][::core::mem::size_of::<quantiles>() - 240usize];
    ["Alignment of quantiles"][::core::mem::align_of::<quantiles>() - 8usize];
    [
        "Offset of field: quantiles::entries",
    ][::core::mem::offset_of!(quantiles, entries) - 0usize];
};
impl Default for quantiles {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct time_stat_buffer {
    pub nr: ::core::ffi::c_uint,
    pub entries: [time_stat_buffer_time_stat_buffer_entry; 31usize],
}
#[repr(C)]
pub struct time_stat_buffer_time_stat_buffer_entry {
    pub start: u64_,
    pub end: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of time_stat_buffer_time_stat_buffer_entry",
    ][::core::mem::size_of::<time_stat_buffer_time_stat_buffer_entry>() - 16usize];
    [
        "Alignment of time_stat_buffer_time_stat_buffer_entry",
    ][::core::mem::align_of::<time_stat_buffer_time_stat_buffer_entry>() - 8usize];
    [
        "Offset of field: time_stat_buffer_time_stat_buffer_entry::start",
    ][::core::mem::offset_of!(time_stat_buffer_time_stat_buffer_entry, start) - 0usize];
    [
        "Offset of field: time_stat_buffer_time_stat_buffer_entry::end",
    ][::core::mem::offset_of!(time_stat_buffer_time_stat_buffer_entry, end) - 8usize];
};
impl Default for time_stat_buffer_time_stat_buffer_entry {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of time_stat_buffer"][::core::mem::size_of::<time_stat_buffer>() - 504usize];
    [
        "Alignment of time_stat_buffer",
    ][::core::mem::align_of::<time_stat_buffer>() - 8usize];
    [
        "Offset of field: time_stat_buffer::nr",
    ][::core::mem::offset_of!(time_stat_buffer, nr) - 0usize];
    [
        "Offset of field: time_stat_buffer::entries",
    ][::core::mem::offset_of!(time_stat_buffer, entries) - 8usize];
};
impl Default for time_stat_buffer {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch2_time_stats {
    pub lock: spinlock_t,
    pub have_quantiles: bool_,
    pub buffer: *mut time_stat_buffer,
    pub min_duration: u64_,
    pub max_duration: u64_,
    pub total_duration: u64_,
    pub max_freq: u64_,
    pub min_freq: u64_,
    pub last_event: u64_,
    pub last_event_start: u64_,
    pub start_time: u64_,
    pub duration_stats: mean_and_variance,
    pub freq_stats: mean_and_variance,
    pub duration_stats_weighted: mean_and_variance,
    pub freq_stats_weighted: mean_and_variance,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch2_time_stats"][::core::mem::size_of::<bch2_time_stats>() - 208usize];
    [
        "Alignment of bch2_time_stats",
    ][::core::mem::align_of::<bch2_time_stats>() - 8usize];
    [
        "Offset of field: bch2_time_stats::lock",
    ][::core::mem::offset_of!(bch2_time_stats, lock) - 0usize];
    [
        "Offset of field: bch2_time_stats::have_quantiles",
    ][::core::mem::offset_of!(bch2_time_stats, have_quantiles) - 4usize];
    [
        "Offset of field: bch2_time_stats::buffer",
    ][::core::mem::offset_of!(bch2_time_stats, buffer) - 8usize];
    [
        "Offset of field: bch2_time_stats::min_duration",
    ][::core::mem::offset_of!(bch2_time_stats, min_duration) - 16usize];
    [
        "Offset of field: bch2_time_stats::max_duration",
    ][::core::mem::offset_of!(bch2_time_stats, max_duration) - 24usize];
    [
        "Offset of field: bch2_time_stats::total_duration",
    ][::core::mem::offset_of!(bch2_time_stats, total_duration) - 32usize];
    [
        "Offset of field: bch2_time_stats::max_freq",
    ][::core::mem::offset_of!(bch2_time_stats, max_freq) - 40usize];
    [
        "Offset of field: bch2_time_stats::min_freq",
    ][::core::mem::offset_of!(bch2_time_stats, min_freq) - 48usize];
    [
        "Offset of field: bch2_time_stats::last_event",
    ][::core::mem::offset_of!(bch2_time_stats, last_event) - 56usize];
    [
        "Offset of field: bch2_time_stats::last_event_start",
    ][::core::mem::offset_of!(bch2_time_stats, last_event_start) - 64usize];
    [
        "Offset of field: bch2_time_stats::start_time",
    ][::core::mem::offset_of!(bch2_time_stats, start_time) - 72usize];
    [
        "Offset of field: bch2_time_stats::duration_stats",
    ][::core::mem::offset_of!(bch2_time_stats, duration_stats) - 80usize];
    [
        "Offset of field: bch2_time_stats::freq_stats",
    ][::core::mem::offset_of!(bch2_time_stats, freq_stats) - 112usize];
    [
        "Offset of field: bch2_time_stats::duration_stats_weighted",
    ][::core::mem::offset_of!(bch2_time_stats, duration_stats_weighted) - 144usize];
    [
        "Offset of field: bch2_time_stats::freq_stats_weighted",
    ][::core::mem::offset_of!(bch2_time_stats, freq_stats_weighted) - 176usize];
};
impl Default for bch2_time_stats {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch2_time_stats_quantiles {
    pub stats: bch2_time_stats,
    pub quantiles: quantiles,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch2_time_stats_quantiles",
    ][::core::mem::size_of::<bch2_time_stats_quantiles>() - 448usize];
    [
        "Alignment of bch2_time_stats_quantiles",
    ][::core::mem::align_of::<bch2_time_stats_quantiles>() - 8usize];
    [
        "Offset of field: bch2_time_stats_quantiles::stats",
    ][::core::mem::offset_of!(bch2_time_stats_quantiles, stats) - 0usize];
    [
        "Offset of field: bch2_time_stats_quantiles::quantiles",
    ][::core::mem::offset_of!(bch2_time_stats_quantiles, quantiles) - 208usize];
};
impl Default for bch2_time_stats_quantiles {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn __bch2_time_stats_clear_buffer(
        arg1: *mut bch2_time_stats,
        arg2: *mut time_stat_buffer,
    );
}
unsafe extern "C" {
    pub fn __bch2_time_stats_update(stats: *mut bch2_time_stats, arg1: u64_, arg2: u64_);
}
unsafe extern "C" {
    /** time_stats_update - collect a new event being tracked

 @stats	- bch2_time_stats to update
 @start	- start time of event, recorded with local_clock()

 The end duration of the event will be the current time*/
    #[link_name = "bch2_time_stats_update__extern"]
    pub fn bch2_time_stats_update(stats: *mut bch2_time_stats, start: u64_);
}
unsafe extern "C" {
    pub fn bch2_time_stats_reset(arg1: *mut bch2_time_stats);
}
unsafe extern "C" {
    pub fn bch2_time_stats_to_seq_buf(
        arg1: *mut seq_buf,
        arg2: *mut bch2_time_stats,
        epoch_name: *const ::core::ffi::c_char,
        flags: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    pub fn bch2_time_stats_to_json(
        arg1: *mut seq_buf,
        arg2: *mut bch2_time_stats,
        epoch_name: *const ::core::ffi::c_char,
        flags: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    pub fn bch2_time_stats_exit(arg1: *mut bch2_time_stats);
}
unsafe extern "C" {
    pub fn bch2_time_stats_init(arg1: *mut bch2_time_stats);
}
unsafe extern "C" {
    pub fn bch2_time_stats_init_no_pcpu(arg1: *mut bch2_time_stats);
}
unsafe extern "C" {
    #[link_name = "bch2_time_stats_quantiles_exit__extern"]
    pub fn bch2_time_stats_quantiles_exit(statq: *mut bch2_time_stats_quantiles);
}
unsafe extern "C" {
    #[link_name = "bch2_time_stats_quantiles_init__extern"]
    pub fn bch2_time_stats_quantiles_init(statq: *mut bch2_time_stats_quantiles);
}
unsafe extern "C" {
    #[link_name = "bch2_kvmalloc_noprof__extern"]
    pub fn bch2_kvmalloc_noprof(n: usize, flags: gfp_t) -> *mut ::core::ffi::c_void;
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum printbuf_si {
    PRINTBUF_UNITS_2 = 0,
    PRINTBUF_UNITS_10 = 1,
}
#[repr(C)]
pub struct printbuf {
    pub buf: *mut ::core::ffi::c_char,
    pub size: ::core::ffi::c_uint,
    pub pos: ::core::ffi::c_uint,
    pub last_newline: ::core::ffi::c_uint,
    pub last_field: ::core::ffi::c_uint,
    pub indent: ::core::ffi::c_uint,
    pub atomic: u8_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub nr_tabstops: u8_,
    pub cur_tabstop: u8_,
    pub _tabstops: [u8_; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of printbuf"][::core::mem::size_of::<printbuf>() - 40usize];
    ["Alignment of printbuf"][::core::mem::align_of::<printbuf>() - 8usize];
    ["Offset of field: printbuf::buf"][::core::mem::offset_of!(printbuf, buf) - 0usize];
    [
        "Offset of field: printbuf::size",
    ][::core::mem::offset_of!(printbuf, size) - 8usize];
    ["Offset of field: printbuf::pos"][::core::mem::offset_of!(printbuf, pos) - 12usize];
    [
        "Offset of field: printbuf::last_newline",
    ][::core::mem::offset_of!(printbuf, last_newline) - 16usize];
    [
        "Offset of field: printbuf::last_field",
    ][::core::mem::offset_of!(printbuf, last_field) - 20usize];
    [
        "Offset of field: printbuf::indent",
    ][::core::mem::offset_of!(printbuf, indent) - 24usize];
    [
        "Offset of field: printbuf::atomic",
    ][::core::mem::offset_of!(printbuf, atomic) - 28usize];
    [
        "Offset of field: printbuf::nr_tabstops",
    ][::core::mem::offset_of!(printbuf, nr_tabstops) - 30usize];
    [
        "Offset of field: printbuf::cur_tabstop",
    ][::core::mem::offset_of!(printbuf, cur_tabstop) - 31usize];
    [
        "Offset of field: printbuf::_tabstops",
    ][::core::mem::offset_of!(printbuf, _tabstops) - 32usize];
};
impl Default for printbuf {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl printbuf {
    #[inline]
    pub fn allocation_failure(&self) -> bool_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_allocation_failure(&mut self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn allocation_failure_raw(this: *const Self) -> bool_ {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 1u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_allocation_failure_raw(this: *mut Self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn heap_allocated(&self) -> bool_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_heap_allocated(&mut self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn heap_allocated_raw(this: *const Self) -> bool_ {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 1usize, 1u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_heap_allocated_raw(this: *mut Self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn overflow(&self) -> bool_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_overflow(&mut self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn overflow_raw(this: *const Self) -> bool_ {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 2usize, 1u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_overflow_raw(this: *mut Self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn suppress(&self) -> bool_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_suppress(&mut self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn suppress_raw(this: *const Self) -> bool_ {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 3usize, 1u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_suppress_raw(this: *mut Self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn si_units(&self) -> printbuf_si {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_si_units(&mut self, val: printbuf_si) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn si_units_raw(this: *const Self) -> printbuf_si {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 4usize, 1u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set_si_units_raw(this: *mut Self, val: printbuf_si) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn human_readable_units(&self) -> bool_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_human_readable_units(&mut self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn human_readable_units_raw(this: *const Self) -> bool_ {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 5usize, 1u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_human_readable_units_raw(this: *mut Self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn has_indent_or_tabstops(&self) -> bool_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_has_indent_or_tabstops(&mut self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn has_indent_or_tabstops_raw(this: *const Self) -> bool_ {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 6usize, 1u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_has_indent_or_tabstops_raw(this: *mut Self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn may_vmalloc(&self) -> bool_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_may_vmalloc(&mut self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn may_vmalloc_raw(this: *const Self) -> bool_ {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 7usize, 1u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_may_vmalloc_raw(this: *mut Self, val: bool_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        allocation_failure: bool_,
        heap_allocated: bool_,
        overflow: bool_,
        suppress: bool_,
        si_units: printbuf_si,
        human_readable_units: bool_,
        has_indent_or_tabstops: bool_,
        may_vmalloc: bool_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                1u8,
                {
                    let allocation_failure: u8 = unsafe {
                        ::core::mem::transmute(allocation_failure)
                    };
                    allocation_failure as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                1usize,
                1u8,
                {
                    let heap_allocated: u8 = unsafe {
                        ::core::mem::transmute(heap_allocated)
                    };
                    heap_allocated as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                2usize,
                1u8,
                {
                    let overflow: u8 = unsafe { ::core::mem::transmute(overflow) };
                    overflow as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                3usize,
                1u8,
                {
                    let suppress: u8 = unsafe { ::core::mem::transmute(suppress) };
                    suppress as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                4usize,
                1u8,
                {
                    let si_units: u32 = unsafe { ::core::mem::transmute(si_units) };
                    si_units as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                5usize,
                1u8,
                {
                    let human_readable_units: u8 = unsafe {
                        ::core::mem::transmute(human_readable_units)
                    };
                    human_readable_units as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                6usize,
                1u8,
                {
                    let has_indent_or_tabstops: u8 = unsafe {
                        ::core::mem::transmute(has_indent_or_tabstops)
                    };
                    has_indent_or_tabstops as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                7usize,
                1u8,
                {
                    let may_vmalloc: u8 = unsafe { ::core::mem::transmute(may_vmalloc) };
                    may_vmalloc as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
pub struct printbuf_restore {
    pub pos: ::core::ffi::c_uint,
    pub last_newline: ::core::ffi::c_uint,
    pub last_field: ::core::ffi::c_uint,
    pub indent: ::core::ffi::c_uint,
    pub cur_tabstop: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of printbuf_restore"][::core::mem::size_of::<printbuf_restore>() - 20usize];
    [
        "Alignment of printbuf_restore",
    ][::core::mem::align_of::<printbuf_restore>() - 4usize];
    [
        "Offset of field: printbuf_restore::pos",
    ][::core::mem::offset_of!(printbuf_restore, pos) - 0usize];
    [
        "Offset of field: printbuf_restore::last_newline",
    ][::core::mem::offset_of!(printbuf_restore, last_newline) - 4usize];
    [
        "Offset of field: printbuf_restore::last_field",
    ][::core::mem::offset_of!(printbuf_restore, last_field) - 8usize];
    [
        "Offset of field: printbuf_restore::indent",
    ][::core::mem::offset_of!(printbuf_restore, indent) - 12usize];
    [
        "Offset of field: printbuf_restore::cur_tabstop",
    ][::core::mem::offset_of!(printbuf_restore, cur_tabstop) - 16usize];
};
impl Default for printbuf_restore {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[link_name = "printbuf_state_save__extern"]
    pub fn printbuf_state_save(buf: *mut printbuf) -> printbuf_restore;
}
unsafe extern "C" {
    #[link_name = "printbuf_state_restore__extern"]
    pub fn printbuf_state_restore(buf: *mut printbuf, s: printbuf_restore);
}
unsafe extern "C" {
    pub fn bch2_printbuf_make_room_gfp(
        arg1: *mut printbuf,
        arg2: ::core::ffi::c_uint,
        arg3: gfp_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_printbuf_make_room(
        arg1: *mut printbuf,
        arg2: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_prt_printf(out: *mut printbuf, fmt: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    pub fn bch2_printbuf_str(arg1: *const printbuf) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn bch2_printbuf_exit(arg1: *mut printbuf);
}
unsafe extern "C" {
    pub fn bch2_printbuf_tabstops_reset(arg1: *mut printbuf);
}
unsafe extern "C" {
    pub fn bch2_printbuf_tabstop_pop(arg1: *mut printbuf);
}
unsafe extern "C" {
    pub fn bch2_printbuf_tabstop_push(
        arg1: *mut printbuf,
        arg2: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_printbuf_indent_add(arg1: *mut printbuf, arg2: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn bch2_printbuf_indent_add_nextline(
        arg1: *mut printbuf,
        arg2: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    pub fn bch2_printbuf_indent_sub(arg1: *mut printbuf, arg2: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn bch2_prt_newline(arg1: *mut printbuf);
}
unsafe extern "C" {
    pub fn bch2_printbuf_strip_trailing_newline(arg1: *mut printbuf);
}
unsafe extern "C" {
    pub fn bch2_prt_tab(arg1: *mut printbuf);
}
unsafe extern "C" {
    pub fn bch2_prt_tab_rjust(arg1: *mut printbuf);
}
unsafe extern "C" {
    pub fn bch2_printbuf_tabstop_align(arg1: *mut printbuf);
}
unsafe extern "C" {
    pub fn bch2_prt_bytes_indented(
        arg1: *mut printbuf,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    pub fn bch2_prt_human_readable_u64(arg1: *mut printbuf, arg2: u64_);
}
unsafe extern "C" {
    pub fn bch2_prt_human_readable_s64(arg1: *mut printbuf, arg2: s64);
}
unsafe extern "C" {
    pub fn bch2_prt_units_u64(arg1: *mut printbuf, arg2: u64_);
}
unsafe extern "C" {
    pub fn bch2_prt_units_s64(arg1: *mut printbuf, arg2: s64);
}
unsafe extern "C" {
    pub fn bch2_prt_string_option(
        arg1: *mut printbuf,
        arg2: *const *const ::core::ffi::c_char,
        arg3: usize,
    );
}
unsafe extern "C" {
    pub fn bch2_prt_bitflags(
        arg1: *mut printbuf,
        arg2: *const *const ::core::ffi::c_char,
        arg3: u64_,
    );
}
unsafe extern "C" {
    pub fn bch2_prt_bitflags_vector(
        arg1: *mut printbuf,
        arg2: *const *const ::core::ffi::c_char,
        arg3: *mut ::core::ffi::c_ulong,
        arg4: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    #[link_name = "bch2_printbuf_init__extern"]
    pub fn bch2_printbuf_init() -> printbuf;
}
unsafe extern "C" {
    #[link_name = "printbuf_remaining_size__extern"]
    pub fn printbuf_remaining_size(out: *mut printbuf) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[link_name = "printbuf_remaining__extern"]
    pub fn printbuf_remaining(out: *mut printbuf) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[link_name = "printbuf_written__extern"]
    pub fn printbuf_written(out: *mut printbuf) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[link_name = "printbuf_nul_terminate_reserved__extern"]
    pub fn printbuf_nul_terminate_reserved(out: *mut printbuf);
}
unsafe extern "C" {
    #[link_name = "printbuf_nul_terminate__extern"]
    pub fn printbuf_nul_terminate(out: *mut printbuf);
}
unsafe extern "C" {
    #[link_name = "printbuf_reset_keep_tabstops__extern"]
    pub fn printbuf_reset_keep_tabstops(buf: *mut printbuf);
}
unsafe extern "C" {
    /// printbuf_reset - re-use a printbuf without freeing and re-initializing it:
    #[link_name = "printbuf_reset__extern"]
    pub fn printbuf_reset(buf: *mut printbuf);
}
unsafe extern "C" {
    /// printbuf_atomic_inc - mark as entering an atomic section
    #[link_name = "printbuf_atomic_inc__extern"]
    pub fn printbuf_atomic_inc(buf: *mut printbuf);
}
unsafe extern "C" {
    /// printbuf_atomic_inc - mark as leaving an atomic section
    #[link_name = "printbuf_atomic_dec__extern"]
    pub fn printbuf_atomic_dec(buf: *mut printbuf);
}
unsafe extern "C" {
    pub fn bch2_pr_time_units(arg1: *mut printbuf, arg2: u64_);
}
unsafe extern "C" {
    pub fn bch2_prt_datetime(arg1: *mut printbuf, arg2: time64_t);
}
unsafe extern "C" {
    pub fn bch2_strtoint_h(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_strtouint_h(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_strtoll_h(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut ::core::ffi::c_longlong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_strtoull_h(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut ::core::ffi::c_ulonglong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_strtou64_h(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut u64_,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "bch2_strtol_h__extern"]
    pub fn bch2_strtol_h(
        cp: *const ::core::ffi::c_char,
        res: *mut ::core::ffi::c_long,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "bch2_strtoul_h__extern"]
    pub fn bch2_strtoul_h(
        cp: *const ::core::ffi::c_char,
        res: *mut ::core::ffi::c_long,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_is_zero(arg1: *const ::core::ffi::c_void, arg2: usize) -> bool_;
}
unsafe extern "C" {
    pub fn bch2_read_flag_list_mask(
        arg1: *const ::core::ffi::c_char,
        arg2: *const *const ::core::ffi::c_char,
        arg3: u64_,
    ) -> u64_;
}
unsafe extern "C" {
    pub fn bch2_read_flag_list(
        arg1: *const ::core::ffi::c_char,
        arg2: *const *const ::core::ffi::c_char,
    ) -> u64_;
}
unsafe extern "C" {
    pub fn bch2_prt_u64_base2_nbits(
        arg1: *mut printbuf,
        arg2: u64_,
        arg3: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    pub fn bch2_prt_u64_base2(arg1: *mut printbuf, arg2: u64_);
}
unsafe extern "C" {
    pub fn bch2_print_string_as_lines(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct bch_stacktrace {
    pub nr: usize,
    pub size: usize,
    pub data: *mut ::core::ffi::c_ulong,
    pub preallocated: __IncompleteArrayField<::core::ffi::c_ulong>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_stacktrace"][::core::mem::size_of::<bch_stacktrace>() - 24usize];
    ["Alignment of bch_stacktrace"][::core::mem::align_of::<bch_stacktrace>() - 8usize];
    [
        "Offset of field: bch_stacktrace::nr",
    ][::core::mem::offset_of!(bch_stacktrace, nr) - 0usize];
    [
        "Offset of field: bch_stacktrace::size",
    ][::core::mem::offset_of!(bch_stacktrace, size) - 8usize];
    [
        "Offset of field: bch_stacktrace::data",
    ][::core::mem::offset_of!(bch_stacktrace, data) - 16usize];
    [
        "Offset of field: bch_stacktrace::preallocated",
    ][::core::mem::offset_of!(bch_stacktrace, preallocated) - 24usize];
};
impl Default for bch_stacktrace {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn bch2_save_backtrace(
        stack: *mut bch_stacktrace,
        arg1: *mut task_struct,
        arg2: ::core::ffi::c_uint,
        arg3: gfp_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_prt_backtrace(arg1: *mut printbuf, arg2: *mut bch_stacktrace);
}
unsafe extern "C" {
    pub fn bch2_prt_task_backtrace(
        arg1: *mut printbuf,
        arg2: *mut task_struct,
        arg3: ::core::ffi::c_uint,
        arg4: gfp_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_time_stats_to_text(arg1: *mut printbuf, arg2: *mut bch2_time_stats);
}
unsafe extern "C" {
    pub fn bch2_time_stats_json_to_text(
        arg1: *mut printbuf,
        arg2: *mut bch2_time_stats,
        epoch_name: *const ::core::ffi::c_char,
        flags: ::core::ffi::c_uint,
    );
}
#[repr(C)]
pub struct bch_ratelimit {
    pub next: u64_,
    pub rate: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_ratelimit"][::core::mem::size_of::<bch_ratelimit>() - 16usize];
    ["Alignment of bch_ratelimit"][::core::mem::align_of::<bch_ratelimit>() - 8usize];
    [
        "Offset of field: bch_ratelimit::next",
    ][::core::mem::offset_of!(bch_ratelimit, next) - 0usize];
    [
        "Offset of field: bch_ratelimit::rate",
    ][::core::mem::offset_of!(bch_ratelimit, rate) - 8usize];
};
impl Default for bch_ratelimit {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[link_name = "bch2_ratelimit_reset__extern"]
    pub fn bch2_ratelimit_reset(d: *mut bch_ratelimit);
}
unsafe extern "C" {
    pub fn bch2_ratelimit_delay(arg1: *mut bch_ratelimit) -> u64_;
}
unsafe extern "C" {
    pub fn bch2_ratelimit_increment(arg1: *mut bch_ratelimit, arg2: u64_);
}
#[repr(C)]
pub struct bch_pd_controller {
    pub rate: bch_ratelimit,
    pub last_update: ::core::ffi::c_ulong,
    pub last_actual: s64,
    pub smoothed_derivative: s64,
    pub p_term_inverse: ::core::ffi::c_uint,
    pub d_smooth: ::core::ffi::c_uint,
    pub d_term: ::core::ffi::c_uint,
    pub last_derivative: s64,
    pub last_proportional: s64,
    pub last_change: s64,
    pub last_target: s64,
    pub backpressure: bool_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_pd_controller"][::core::mem::size_of::<bch_pd_controller>() - 96usize];
    [
        "Alignment of bch_pd_controller",
    ][::core::mem::align_of::<bch_pd_controller>() - 8usize];
    [
        "Offset of field: bch_pd_controller::rate",
    ][::core::mem::offset_of!(bch_pd_controller, rate) - 0usize];
    [
        "Offset of field: bch_pd_controller::last_update",
    ][::core::mem::offset_of!(bch_pd_controller, last_update) - 16usize];
    [
        "Offset of field: bch_pd_controller::last_actual",
    ][::core::mem::offset_of!(bch_pd_controller, last_actual) - 24usize];
    [
        "Offset of field: bch_pd_controller::smoothed_derivative",
    ][::core::mem::offset_of!(bch_pd_controller, smoothed_derivative) - 32usize];
    [
        "Offset of field: bch_pd_controller::p_term_inverse",
    ][::core::mem::offset_of!(bch_pd_controller, p_term_inverse) - 40usize];
    [
        "Offset of field: bch_pd_controller::d_smooth",
    ][::core::mem::offset_of!(bch_pd_controller, d_smooth) - 44usize];
    [
        "Offset of field: bch_pd_controller::d_term",
    ][::core::mem::offset_of!(bch_pd_controller, d_term) - 48usize];
    [
        "Offset of field: bch_pd_controller::last_derivative",
    ][::core::mem::offset_of!(bch_pd_controller, last_derivative) - 56usize];
    [
        "Offset of field: bch_pd_controller::last_proportional",
    ][::core::mem::offset_of!(bch_pd_controller, last_proportional) - 64usize];
    [
        "Offset of field: bch_pd_controller::last_change",
    ][::core::mem::offset_of!(bch_pd_controller, last_change) - 72usize];
    [
        "Offset of field: bch_pd_controller::last_target",
    ][::core::mem::offset_of!(bch_pd_controller, last_target) - 80usize];
    [
        "Offset of field: bch_pd_controller::backpressure",
    ][::core::mem::offset_of!(bch_pd_controller, backpressure) - 88usize];
};
impl Default for bch_pd_controller {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn bch2_pd_controller_update(
        arg1: *mut bch_pd_controller,
        arg2: s64,
        arg3: s64,
        arg4: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn bch2_pd_controller_init(arg1: *mut bch_pd_controller);
}
unsafe extern "C" {
    pub fn bch2_pd_controller_debug_to_text(
        arg1: *mut printbuf,
        arg2: *mut bch_pd_controller,
    );
}
unsafe extern "C" {
    pub fn bch2_bio_map(bio: *mut bio, base: *mut ::core::ffi::c_void, arg1: usize);
}
unsafe extern "C" {
    pub fn bch2_bio_map_and_chain(
        arg1: *mut block_device,
        arg2: *mut ::core::ffi::c_void,
        arg3: usize,
        arg4: sector_t,
        arg5: blk_opf_t,
        arg6: gfp_t,
        arg7: *mut bio_set,
    ) -> *mut bio;
}
unsafe extern "C" {
    pub fn bch2_bio_submit_buf_wait(
        arg1: *mut block_device,
        arg2: *mut ::core::ffi::c_void,
        arg3: usize,
        arg4: sector_t,
        arg5: blk_opf_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_bio_alloc_pages(
        arg1: *mut bio,
        arg2: ::core::ffi::c_uint,
        arg3: usize,
        arg4: gfp_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_get_random_u64_below(arg1: u64_) -> u64_;
}
unsafe extern "C" {
    #[link_name = "bch2_local_clock__extern"]
    pub fn bch2_local_clock() -> u64_;
}
unsafe extern "C" {
    #[link_name = "bch2_cond_resched__extern"]
    pub fn bch2_cond_resched();
}
unsafe extern "C" {
    pub fn bch2_bio_copy_data_iter(
        arg1: *mut bio,
        arg2: *mut bvec_iter,
        arg3: *mut bio,
        arg4: *mut bvec_iter,
    );
}
unsafe extern "C" {
    pub fn bch2_zero_fill_bio_iter(arg1: *mut bio, arg2: bvec_iter);
}
unsafe extern "C" {
    pub fn bch2_bio_set_pages_dirty(arg1: *mut bio);
}
unsafe extern "C" {
    pub fn bch2_bio_check_pages_dirty(arg1: *mut bio);
}
unsafe extern "C" {
    pub fn bch2_corrupt_bio(arg1: *mut bio);
}
unsafe extern "C" {
    #[link_name = "bch2_maybe_corrupt_bio__extern"]
    pub fn bch2_maybe_corrupt_bio(bio: *mut bio, ratio: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn bch2_bio_to_text(arg1: *mut printbuf, arg2: *mut bio);
}
unsafe extern "C" {
    pub fn bch2_acc_percpu_u64s(arg1: *mut u64_, arg2: ::core::ffi::c_uint) -> *mut u64_;
}
unsafe extern "C" {
    pub fn bch2_split_devs(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut darray_const_str,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bch2_bit_wait_io_timeout(
        arg1: *mut wait_bit_key,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
pub type __uuid_t = uuid_t;
#[repr(C)]
pub struct bkey_format {
    pub key_u64s: __u8,
    pub nr_fields: __u8,
    pub bits_per_field: [__u8; 6usize],
    pub field_offset: [__le64; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bkey_format"][::core::mem::size_of::<bkey_format>() - 56usize];
    ["Alignment of bkey_format"][::core::mem::align_of::<bkey_format>() - 8usize];
    [
        "Offset of field: bkey_format::key_u64s",
    ][::core::mem::offset_of!(bkey_format, key_u64s) - 0usize];
    [
        "Offset of field: bkey_format::nr_fields",
    ][::core::mem::offset_of!(bkey_format, nr_fields) - 1usize];
    [
        "Offset of field: bkey_format::bits_per_field",
    ][::core::mem::offset_of!(bkey_format, bits_per_field) - 2usize];
    [
        "Offset of field: bkey_format::field_offset",
    ][::core::mem::offset_of!(bkey_format, field_offset) - 8usize];
};
impl Default for bkey_format {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct bpos {
    pub snapshot: __u32,
    pub offset: __u64,
    pub inode: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bpos"][::core::mem::size_of::<bpos>() - 20usize];
    ["Alignment of bpos"][::core::mem::align_of::<bpos>() - 4usize];
    [
        "Offset of field: bpos::snapshot",
    ][::core::mem::offset_of!(bpos, snapshot) - 0usize];
    ["Offset of field: bpos::offset"][::core::mem::offset_of!(bpos, offset) - 4usize];
    ["Offset of field: bpos::inode"][::core::mem::offset_of!(bpos, inode) - 12usize];
};
impl Default for bpos {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_val {
    pub __nothing: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_val"][::core::mem::size_of::<bch_val>() - 0usize];
    ["Alignment of bch_val"][::core::mem::align_of::<bch_val>() - 8usize];
    [
        "Offset of field: bch_val::__nothing",
    ][::core::mem::offset_of!(bch_val, __nothing) - 0usize];
};
impl Default for bch_val {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(4))]
pub struct bversion {
    pub lo: __u64,
    pub hi: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bversion"][::core::mem::size_of::<bversion>() - 12usize];
    ["Alignment of bversion"][::core::mem::align_of::<bversion>() - 4usize];
    ["Offset of field: bversion::lo"][::core::mem::offset_of!(bversion, lo) - 0usize];
    ["Offset of field: bversion::hi"][::core::mem::offset_of!(bversion, hi) - 8usize];
};
impl Default for bversion {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[repr(align(8))]
pub struct bkey {
    pub u64s: __u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub type_: __u8,
    pub pad: [__u8; 1usize],
    pub bversion: bversion,
    pub size: __u32,
    pub p: bpos,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bkey"][::core::mem::size_of::<bkey>() - 40usize];
    ["Alignment of bkey"][::core::mem::align_of::<bkey>() - 8usize];
    ["Offset of field: bkey::u64s"][::core::mem::offset_of!(bkey, u64s) - 0usize];
    ["Offset of field: bkey::type_"][::core::mem::offset_of!(bkey, type_) - 2usize];
    ["Offset of field: bkey::pad"][::core::mem::offset_of!(bkey, pad) - 3usize];
    [
        "Offset of field: bkey::bversion",
    ][::core::mem::offset_of!(bkey, bversion) - 4usize];
    ["Offset of field: bkey::size"][::core::mem::offset_of!(bkey, size) - 16usize];
    ["Offset of field: bkey::p"][::core::mem::offset_of!(bkey, p) - 20usize];
};
impl Default for bkey {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bkey {
    #[inline]
    pub fn format(&self) -> __u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_format(&mut self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn format_raw(this: *const Self) -> __u8 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 7u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_format_raw(this: *mut Self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn needs_whiteout(&self) -> __u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_needs_whiteout(&mut self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn needs_whiteout_raw(this: *const Self) -> __u8 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 7usize, 1u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_needs_whiteout_raw(this: *mut Self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        format: __u8,
        needs_whiteout: __u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                7u8,
                {
                    let format: u8 = unsafe { ::core::mem::transmute(format) };
                    format as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                7usize,
                1u8,
                {
                    let needs_whiteout: u8 = unsafe {
                        ::core::mem::transmute(needs_whiteout)
                    };
                    needs_whiteout as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed(8))]
pub struct bkey_packed {
    pub _data: __IncompleteArrayField<__u64>,
    pub u64s: __u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub type_: __u8,
    pub key_start: __IncompleteArrayField<__u8>,
    pub pad: [__u8; 37usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bkey_packed"][::core::mem::size_of::<bkey_packed>() - 40usize];
    ["Alignment of bkey_packed"][::core::mem::align_of::<bkey_packed>() - 8usize];
    [
        "Offset of field: bkey_packed::_data",
    ][::core::mem::offset_of!(bkey_packed, _data) - 0usize];
    [
        "Offset of field: bkey_packed::u64s",
    ][::core::mem::offset_of!(bkey_packed, u64s) - 0usize];
    [
        "Offset of field: bkey_packed::type_",
    ][::core::mem::offset_of!(bkey_packed, type_) - 2usize];
    [
        "Offset of field: bkey_packed::key_start",
    ][::core::mem::offset_of!(bkey_packed, key_start) - 3usize];
    [
        "Offset of field: bkey_packed::pad",
    ][::core::mem::offset_of!(bkey_packed, pad) - 3usize];
};
impl Default for bkey_packed {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bkey_packed {
    #[inline]
    pub fn format(&self) -> __u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_format(&mut self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn format_raw(this: *const Self) -> __u8 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 7u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_format_raw(this: *mut Self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn needs_whiteout(&self) -> __u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_needs_whiteout(&mut self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn needs_whiteout_raw(this: *const Self) -> __u8 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 7usize, 1u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_needs_whiteout_raw(this: *mut Self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        format: __u8,
        needs_whiteout: __u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                7u8,
                {
                    let format: u8 = unsafe { ::core::mem::transmute(format) };
                    format as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                7usize,
                1u8,
                {
                    let needs_whiteout: u8 = unsafe {
                        ::core::mem::transmute(needs_whiteout)
                    };
                    needs_whiteout as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
pub struct bch_le128 {
    pub lo: __le64,
    pub hi: __le64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_le128"][::core::mem::size_of::<bch_le128>() - 16usize];
    ["Alignment of bch_le128"][::core::mem::align_of::<bch_le128>() - 8usize];
    ["Offset of field: bch_le128::lo"][::core::mem::offset_of!(bch_le128, lo) - 0usize];
    ["Offset of field: bch_le128::hi"][::core::mem::offset_of!(bch_le128, hi) - 8usize];
};
impl Default for bch_le128 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_bkey_fields {
    BKEY_FIELD_INODE = 0,
    BKEY_FIELD_OFFSET = 1,
    BKEY_FIELD_SNAPSHOT = 2,
    BKEY_FIELD_SIZE = 3,
    BKEY_FIELD_VERSION_HI = 4,
    BKEY_FIELD_VERSION_LO = 5,
    BKEY_NR_FIELDS = 6,
}
#[repr(C)]
pub struct bkey_i {
    pub _data: __IncompleteArrayField<__u64>,
    pub k: bkey,
    pub v: bch_val,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bkey_i"][::core::mem::size_of::<bkey_i>() - 40usize];
    ["Alignment of bkey_i"][::core::mem::align_of::<bkey_i>() - 8usize];
    ["Offset of field: bkey_i::_data"][::core::mem::offset_of!(bkey_i, _data) - 0usize];
    ["Offset of field: bkey_i::k"][::core::mem::offset_of!(bkey_i, k) - 0usize];
    ["Offset of field: bkey_i::v"][::core::mem::offset_of!(bkey_i, v) - 40usize];
};
impl Default for bkey_i {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_bkey_type_flags {
    BKEY_TYPE_strict_btree_checks = 1,
}
impl bch_bkey_type {
    pub const KEY_TYPE_deleted: bch_bkey_type = bch_bkey_type(0);
    pub const KEY_TYPE_whiteout: bch_bkey_type = bch_bkey_type(1);
    pub const KEY_TYPE_error: bch_bkey_type = bch_bkey_type(2);
    pub const KEY_TYPE_cookie: bch_bkey_type = bch_bkey_type(3);
    pub const KEY_TYPE_hash_whiteout: bch_bkey_type = bch_bkey_type(4);
    pub const KEY_TYPE_btree_ptr: bch_bkey_type = bch_bkey_type(5);
    pub const KEY_TYPE_extent: bch_bkey_type = bch_bkey_type(6);
    pub const KEY_TYPE_reservation: bch_bkey_type = bch_bkey_type(7);
    pub const KEY_TYPE_inode: bch_bkey_type = bch_bkey_type(8);
    pub const KEY_TYPE_inode_generation: bch_bkey_type = bch_bkey_type(9);
    pub const KEY_TYPE_dirent: bch_bkey_type = bch_bkey_type(10);
    pub const KEY_TYPE_xattr: bch_bkey_type = bch_bkey_type(11);
    pub const KEY_TYPE_alloc: bch_bkey_type = bch_bkey_type(12);
    pub const KEY_TYPE_quota: bch_bkey_type = bch_bkey_type(13);
    pub const KEY_TYPE_stripe: bch_bkey_type = bch_bkey_type(14);
    pub const KEY_TYPE_reflink_p: bch_bkey_type = bch_bkey_type(15);
    pub const KEY_TYPE_reflink_v: bch_bkey_type = bch_bkey_type(16);
    pub const KEY_TYPE_inline_data: bch_bkey_type = bch_bkey_type(17);
    pub const KEY_TYPE_btree_ptr_v2: bch_bkey_type = bch_bkey_type(18);
    pub const KEY_TYPE_indirect_inline_data: bch_bkey_type = bch_bkey_type(19);
    pub const KEY_TYPE_alloc_v2: bch_bkey_type = bch_bkey_type(20);
    pub const KEY_TYPE_subvolume: bch_bkey_type = bch_bkey_type(21);
    pub const KEY_TYPE_snapshot: bch_bkey_type = bch_bkey_type(22);
    pub const KEY_TYPE_inode_v2: bch_bkey_type = bch_bkey_type(23);
    pub const KEY_TYPE_alloc_v3: bch_bkey_type = bch_bkey_type(24);
    pub const KEY_TYPE_set: bch_bkey_type = bch_bkey_type(25);
    pub const KEY_TYPE_lru: bch_bkey_type = bch_bkey_type(26);
    pub const KEY_TYPE_alloc_v4: bch_bkey_type = bch_bkey_type(27);
    pub const KEY_TYPE_backpointer: bch_bkey_type = bch_bkey_type(28);
    pub const KEY_TYPE_inode_v3: bch_bkey_type = bch_bkey_type(29);
    pub const KEY_TYPE_bucket_gens: bch_bkey_type = bch_bkey_type(30);
    pub const KEY_TYPE_snapshot_tree: bch_bkey_type = bch_bkey_type(31);
    pub const KEY_TYPE_logged_op_truncate: bch_bkey_type = bch_bkey_type(32);
    pub const KEY_TYPE_logged_op_finsert: bch_bkey_type = bch_bkey_type(33);
    pub const KEY_TYPE_accounting: bch_bkey_type = bch_bkey_type(34);
    pub const KEY_TYPE_inode_alloc_cursor: bch_bkey_type = bch_bkey_type(35);
    pub const KEY_TYPE_extent_whiteout: bch_bkey_type = bch_bkey_type(36);
    pub const KEY_TYPE_logged_op_stripe_update: bch_bkey_type = bch_bkey_type(37);
    pub const KEY_TYPE_MAX: bch_bkey_type = bch_bkey_type(38);
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct bch_bkey_type(pub ::core::ffi::c_uint);
#[repr(C)]
pub struct bch_deleted {
    pub v: bch_val,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_deleted"][::core::mem::size_of::<bch_deleted>() - 0usize];
    ["Alignment of bch_deleted"][::core::mem::align_of::<bch_deleted>() - 8usize];
    [
        "Offset of field: bch_deleted::v",
    ][::core::mem::offset_of!(bch_deleted, v) - 0usize];
};
impl Default for bch_deleted {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_whiteout {
    pub v: bch_val,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_whiteout"][::core::mem::size_of::<bch_whiteout>() - 0usize];
    ["Alignment of bch_whiteout"][::core::mem::align_of::<bch_whiteout>() - 8usize];
    [
        "Offset of field: bch_whiteout::v",
    ][::core::mem::offset_of!(bch_whiteout, v) - 0usize];
};
impl Default for bch_whiteout {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_extent_whiteout {
    pub v: bch_val,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_extent_whiteout",
    ][::core::mem::size_of::<bch_extent_whiteout>() - 0usize];
    [
        "Alignment of bch_extent_whiteout",
    ][::core::mem::align_of::<bch_extent_whiteout>() - 8usize];
    [
        "Offset of field: bch_extent_whiteout::v",
    ][::core::mem::offset_of!(bch_extent_whiteout, v) - 0usize];
};
impl Default for bch_extent_whiteout {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_error {
    pub v: bch_val,
    pub err: u8_,
    pub pad: [u8_; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_error"][::core::mem::size_of::<bch_error>() - 8usize];
    ["Alignment of bch_error"][::core::mem::align_of::<bch_error>() - 8usize];
    ["Offset of field: bch_error::v"][::core::mem::offset_of!(bch_error, v) - 0usize];
    [
        "Offset of field: bch_error::err",
    ][::core::mem::offset_of!(bch_error, err) - 0usize];
    [
        "Offset of field: bch_error::pad",
    ][::core::mem::offset_of!(bch_error, pad) - 1usize];
};
impl Default for bch_error {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_key_type_errors {
    KEY_TYPE_ERROR_unknown = 0,
    KEY_TYPE_ERROR_device_removed = 1,
    KEY_TYPE_ERROR_double_allocation = 2,
    KEY_TYPE_ERROR_no_valid_pointers_repair = 3,
}
#[repr(C)]
pub struct bch_cookie {
    pub v: bch_val,
    pub cookie: __le64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_cookie"][::core::mem::size_of::<bch_cookie>() - 8usize];
    ["Alignment of bch_cookie"][::core::mem::align_of::<bch_cookie>() - 8usize];
    ["Offset of field: bch_cookie::v"][::core::mem::offset_of!(bch_cookie, v) - 0usize];
    [
        "Offset of field: bch_cookie::cookie",
    ][::core::mem::offset_of!(bch_cookie, cookie) - 0usize];
};
impl Default for bch_cookie {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_hash_whiteout {
    pub v: bch_val,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_hash_whiteout"][::core::mem::size_of::<bch_hash_whiteout>() - 0usize];
    [
        "Alignment of bch_hash_whiteout",
    ][::core::mem::align_of::<bch_hash_whiteout>() - 8usize];
    [
        "Offset of field: bch_hash_whiteout::v",
    ][::core::mem::offset_of!(bch_hash_whiteout, v) - 0usize];
};
impl Default for bch_hash_whiteout {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_set {
    pub v: bch_val,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_set"][::core::mem::size_of::<bch_set>() - 0usize];
    ["Alignment of bch_set"][::core::mem::align_of::<bch_set>() - 8usize];
    ["Offset of field: bch_set::v"][::core::mem::offset_of!(bch_set, v) - 0usize];
};
impl Default for bch_set {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_csum {
    pub lo: __le64,
    pub hi: __le64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_csum"][::core::mem::size_of::<bch_csum>() - 16usize];
    ["Alignment of bch_csum"][::core::mem::align_of::<bch_csum>() - 8usize];
    ["Offset of field: bch_csum::lo"][::core::mem::offset_of!(bch_csum, lo) - 0usize];
    ["Offset of field: bch_csum::hi"][::core::mem::offset_of!(bch_csum, hi) - 8usize];
};
impl Default for bch_csum {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_backpointer {
    pub v: bch_val,
    pub btree_id: __u8,
    pub level: __u8,
    pub data_type: __u8,
    pub bucket_gen: __u8,
    pub flags: __u32,
    pub bucket_len: __u32,
    pub pos: bpos,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_backpointer"][::core::mem::size_of::<bch_backpointer>() - 32usize];
    [
        "Alignment of bch_backpointer",
    ][::core::mem::align_of::<bch_backpointer>() - 8usize];
    [
        "Offset of field: bch_backpointer::v",
    ][::core::mem::offset_of!(bch_backpointer, v) - 0usize];
    [
        "Offset of field: bch_backpointer::btree_id",
    ][::core::mem::offset_of!(bch_backpointer, btree_id) - 0usize];
    [
        "Offset of field: bch_backpointer::level",
    ][::core::mem::offset_of!(bch_backpointer, level) - 1usize];
    [
        "Offset of field: bch_backpointer::data_type",
    ][::core::mem::offset_of!(bch_backpointer, data_type) - 2usize];
    [
        "Offset of field: bch_backpointer::bucket_gen",
    ][::core::mem::offset_of!(bch_backpointer, bucket_gen) - 3usize];
    [
        "Offset of field: bch_backpointer::flags",
    ][::core::mem::offset_of!(bch_backpointer, flags) - 4usize];
    [
        "Offset of field: bch_backpointer::bucket_len",
    ][::core::mem::offset_of!(bch_backpointer, bucket_len) - 8usize];
    [
        "Offset of field: bch_backpointer::pos",
    ][::core::mem::offset_of!(bch_backpointer, pos) - 12usize];
};
impl Default for bch_backpointer {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_sb_field {
    pub _data: __IncompleteArrayField<__u64>,
    pub u64s: __le32,
    pub type_: __le32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_sb_field"][::core::mem::size_of::<bch_sb_field>() - 8usize];
    ["Alignment of bch_sb_field"][::core::mem::align_of::<bch_sb_field>() - 8usize];
    [
        "Offset of field: bch_sb_field::_data",
    ][::core::mem::offset_of!(bch_sb_field, _data) - 0usize];
    [
        "Offset of field: bch_sb_field::u64s",
    ][::core::mem::offset_of!(bch_sb_field, u64s) - 0usize];
    [
        "Offset of field: bch_sb_field::type_",
    ][::core::mem::offset_of!(bch_sb_field, type_) - 4usize];
};
impl Default for bch_sb_field {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum btree_id {
    BTREE_ID_extents = 0,
    BTREE_ID_inodes = 1,
    BTREE_ID_dirents = 2,
    BTREE_ID_xattrs = 3,
    BTREE_ID_alloc = 4,
    BTREE_ID_quotas = 5,
    BTREE_ID_stripes = 6,
    BTREE_ID_reflink = 7,
    BTREE_ID_subvolumes = 8,
    BTREE_ID_snapshots = 9,
    BTREE_ID_lru = 10,
    BTREE_ID_freespace = 11,
    BTREE_ID_need_discard = 12,
    BTREE_ID_backpointers = 13,
    BTREE_ID_bucket_gens = 14,
    BTREE_ID_snapshot_trees = 15,
    BTREE_ID_deleted_inodes = 16,
    BTREE_ID_logged_ops = 17,
    BTREE_ID_reconcile_work = 18,
    BTREE_ID_subvolume_children = 19,
    BTREE_ID_accounting = 20,
    BTREE_ID_reconcile_hipri = 21,
    BTREE_ID_reconcile_pending = 22,
    BTREE_ID_reconcile_scan = 23,
    BTREE_ID_reconcile_work_phys = 24,
    BTREE_ID_reconcile_hipri_phys = 25,
    BTREE_ID_bucket_to_stripe = 26,
    BTREE_ID_stripe_backpointers = 27,
    BTREE_ID_NR = 28,
}
#[repr(C, packed)]
pub struct bch_replicas_entry_v0 {
    pub data_type: __u8,
    pub nr_devs: __u8,
    pub devs: __IncompleteArrayField<::core::ffi::c_uchar>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_replicas_entry_v0",
    ][::core::mem::size_of::<bch_replicas_entry_v0>() - 2usize];
    [
        "Alignment of bch_replicas_entry_v0",
    ][::core::mem::align_of::<bch_replicas_entry_v0>() - 1usize];
    [
        "Offset of field: bch_replicas_entry_v0::data_type",
    ][::core::mem::offset_of!(bch_replicas_entry_v0, data_type) - 0usize];
    [
        "Offset of field: bch_replicas_entry_v0::nr_devs",
    ][::core::mem::offset_of!(bch_replicas_entry_v0, nr_devs) - 1usize];
    [
        "Offset of field: bch_replicas_entry_v0::devs",
    ][::core::mem::offset_of!(bch_replicas_entry_v0, devs) - 2usize];
};
impl Default for bch_replicas_entry_v0 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_sb_field_replicas_v0 {
    pub field: bch_sb_field,
    pub entries: __IncompleteArrayField<bch_replicas_entry_v0>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_sb_field_replicas_v0",
    ][::core::mem::size_of::<bch_sb_field_replicas_v0>() - 8usize];
    [
        "Alignment of bch_sb_field_replicas_v0",
    ][::core::mem::align_of::<bch_sb_field_replicas_v0>() - 8usize];
    [
        "Offset of field: bch_sb_field_replicas_v0::field",
    ][::core::mem::offset_of!(bch_sb_field_replicas_v0, field) - 0usize];
    [
        "Offset of field: bch_sb_field_replicas_v0::entries",
    ][::core::mem::offset_of!(bch_sb_field_replicas_v0, entries) - 8usize];
};
impl Default for bch_sb_field_replicas_v0 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
pub struct bch_replicas_entry_v1 {
    pub data_type: __u8,
    pub nr_devs: __u8,
    pub nr_required: __u8,
    pub devs: __IncompleteArrayField<__u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_replicas_entry_v1",
    ][::core::mem::size_of::<bch_replicas_entry_v1>() - 3usize];
    [
        "Alignment of bch_replicas_entry_v1",
    ][::core::mem::align_of::<bch_replicas_entry_v1>() - 1usize];
    [
        "Offset of field: bch_replicas_entry_v1::data_type",
    ][::core::mem::offset_of!(bch_replicas_entry_v1, data_type) - 0usize];
    [
        "Offset of field: bch_replicas_entry_v1::nr_devs",
    ][::core::mem::offset_of!(bch_replicas_entry_v1, nr_devs) - 1usize];
    [
        "Offset of field: bch_replicas_entry_v1::nr_required",
    ][::core::mem::offset_of!(bch_replicas_entry_v1, nr_required) - 2usize];
    [
        "Offset of field: bch_replicas_entry_v1::devs",
    ][::core::mem::offset_of!(bch_replicas_entry_v1, devs) - 3usize];
};
impl Default for bch_replicas_entry_v1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_sb_field_replicas {
    pub field: bch_sb_field,
    pub entries: __IncompleteArrayField<bch_replicas_entry_v1>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_sb_field_replicas",
    ][::core::mem::size_of::<bch_sb_field_replicas>() - 8usize];
    [
        "Alignment of bch_sb_field_replicas",
    ][::core::mem::align_of::<bch_sb_field_replicas>() - 8usize];
    [
        "Offset of field: bch_sb_field_replicas::field",
    ][::core::mem::offset_of!(bch_sb_field_replicas, field) - 0usize];
    [
        "Offset of field: bch_sb_field_replicas::entries",
    ][::core::mem::offset_of!(bch_sb_field_replicas, entries) - 8usize];
};
impl Default for bch_sb_field_replicas {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_accounting {
    pub v: bch_val,
    pub d: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_accounting"][::core::mem::size_of::<bch_accounting>() - 0usize];
    ["Alignment of bch_accounting"][::core::mem::align_of::<bch_accounting>() - 8usize];
    [
        "Offset of field: bch_accounting::v",
    ][::core::mem::offset_of!(bch_accounting, v) - 0usize];
    [
        "Offset of field: bch_accounting::d",
    ][::core::mem::offset_of!(bch_accounting, d) - 0usize];
};
impl Default for bch_accounting {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bch_data_type {
    pub const BCH_DATA_free: bch_data_type = bch_data_type(0);
    pub const BCH_DATA_sb: bch_data_type = bch_data_type(1);
    pub const BCH_DATA_journal: bch_data_type = bch_data_type(2);
    pub const BCH_DATA_btree: bch_data_type = bch_data_type(3);
    pub const BCH_DATA_user: bch_data_type = bch_data_type(4);
    pub const BCH_DATA_cached: bch_data_type = bch_data_type(5);
    pub const BCH_DATA_parity: bch_data_type = bch_data_type(6);
    pub const BCH_DATA_stripe: bch_data_type = bch_data_type(7);
    pub const BCH_DATA_need_gc_gens: bch_data_type = bch_data_type(8);
    pub const BCH_DATA_need_discard: bch_data_type = bch_data_type(9);
    pub const BCH_DATA_unstriped: bch_data_type = bch_data_type(10);
    pub const BCH_DATA_multiple: bch_data_type = bch_data_type(11);
    pub const BCH_DATA_NR: bch_data_type = bch_data_type(12);
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct bch_data_type(pub ::core::ffi::c_uint);
impl disk_accounting_type {
    pub const BCH_DISK_ACCOUNTING_nr_inodes: disk_accounting_type = disk_accounting_type(
        0,
    );
    pub const BCH_DISK_ACCOUNTING_persistent_reserved: disk_accounting_type = disk_accounting_type(
        1,
    );
    pub const BCH_DISK_ACCOUNTING_replicas: disk_accounting_type = disk_accounting_type(
        2,
    );
    pub const BCH_DISK_ACCOUNTING_dev_data_type: disk_accounting_type = disk_accounting_type(
        3,
    );
    pub const BCH_DISK_ACCOUNTING_compression: disk_accounting_type = disk_accounting_type(
        4,
    );
    pub const BCH_DISK_ACCOUNTING_snapshot: disk_accounting_type = disk_accounting_type(
        5,
    );
    pub const BCH_DISK_ACCOUNTING_btree: disk_accounting_type = disk_accounting_type(6);
    pub const BCH_DISK_ACCOUNTING_rebalance_work: disk_accounting_type = disk_accounting_type(
        7,
    );
    pub const BCH_DISK_ACCOUNTING_inum: disk_accounting_type = disk_accounting_type(8);
    pub const BCH_DISK_ACCOUNTING_reconcile_work: disk_accounting_type = disk_accounting_type(
        9,
    );
    pub const BCH_DISK_ACCOUNTING_dev_leaving: disk_accounting_type = disk_accounting_type(
        10,
    );
    pub const BCH_DISK_ACCOUNTING_TYPE_NR: disk_accounting_type = disk_accounting_type(
        11,
    );
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct disk_accounting_type(pub ::core::ffi::c_uint);
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bch_acct_nr_inodes {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_acct_nr_inodes",
    ][::core::mem::size_of::<bch_acct_nr_inodes>() - 0usize];
    [
        "Alignment of bch_acct_nr_inodes",
    ][::core::mem::align_of::<bch_acct_nr_inodes>() - 1usize];
};
#[repr(C)]
pub struct bch_acct_persistent_reserved {
    pub nr_replicas: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_acct_persistent_reserved",
    ][::core::mem::size_of::<bch_acct_persistent_reserved>() - 1usize];
    [
        "Alignment of bch_acct_persistent_reserved",
    ][::core::mem::align_of::<bch_acct_persistent_reserved>() - 1usize];
    [
        "Offset of field: bch_acct_persistent_reserved::nr_replicas",
    ][::core::mem::offset_of!(bch_acct_persistent_reserved, nr_replicas) - 0usize];
};
impl Default for bch_acct_persistent_reserved {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type bch_acct_replicas = bch_replicas_entry_v1;
#[repr(C)]
pub struct bch_acct_dev_data_type {
    pub dev: __u8,
    pub data_type: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_acct_dev_data_type",
    ][::core::mem::size_of::<bch_acct_dev_data_type>() - 2usize];
    [
        "Alignment of bch_acct_dev_data_type",
    ][::core::mem::align_of::<bch_acct_dev_data_type>() - 1usize];
    [
        "Offset of field: bch_acct_dev_data_type::dev",
    ][::core::mem::offset_of!(bch_acct_dev_data_type, dev) - 0usize];
    [
        "Offset of field: bch_acct_dev_data_type::data_type",
    ][::core::mem::offset_of!(bch_acct_dev_data_type, data_type) - 1usize];
};
impl Default for bch_acct_dev_data_type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_acct_compression {
    pub type_: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_acct_compression",
    ][::core::mem::size_of::<bch_acct_compression>() - 1usize];
    [
        "Alignment of bch_acct_compression",
    ][::core::mem::align_of::<bch_acct_compression>() - 1usize];
    [
        "Offset of field: bch_acct_compression::type_",
    ][::core::mem::offset_of!(bch_acct_compression, type_) - 0usize];
};
impl Default for bch_acct_compression {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
pub struct bch_acct_snapshot {
    pub id: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_acct_snapshot"][::core::mem::size_of::<bch_acct_snapshot>() - 4usize];
    [
        "Alignment of bch_acct_snapshot",
    ][::core::mem::align_of::<bch_acct_snapshot>() - 1usize];
    [
        "Offset of field: bch_acct_snapshot::id",
    ][::core::mem::offset_of!(bch_acct_snapshot, id) - 0usize];
};
impl Default for bch_acct_snapshot {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
pub struct bch_acct_btree {
    pub id: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_acct_btree"][::core::mem::size_of::<bch_acct_btree>() - 4usize];
    ["Alignment of bch_acct_btree"][::core::mem::align_of::<bch_acct_btree>() - 1usize];
    [
        "Offset of field: bch_acct_btree::id",
    ][::core::mem::offset_of!(bch_acct_btree, id) - 0usize];
};
impl Default for bch_acct_btree {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
pub struct bch_acct_inum {
    pub inum: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_acct_inum"][::core::mem::size_of::<bch_acct_inum>() - 8usize];
    ["Alignment of bch_acct_inum"][::core::mem::align_of::<bch_acct_inum>() - 1usize];
    [
        "Offset of field: bch_acct_inum::inum",
    ][::core::mem::offset_of!(bch_acct_inum, inum) - 0usize];
};
impl Default for bch_acct_inum {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bch_acct_rebalance_work {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_acct_rebalance_work",
    ][::core::mem::size_of::<bch_acct_rebalance_work>() - 0usize];
    [
        "Alignment of bch_acct_rebalance_work",
    ][::core::mem::align_of::<bch_acct_rebalance_work>() - 1usize];
};
#[repr(C)]
pub struct bch_acct_reconcile_work {
    pub type_: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_acct_reconcile_work",
    ][::core::mem::size_of::<bch_acct_reconcile_work>() - 1usize];
    [
        "Alignment of bch_acct_reconcile_work",
    ][::core::mem::align_of::<bch_acct_reconcile_work>() - 1usize];
    [
        "Offset of field: bch_acct_reconcile_work::type_",
    ][::core::mem::offset_of!(bch_acct_reconcile_work, type_) - 0usize];
};
impl Default for bch_acct_reconcile_work {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
pub struct bch_acct_dev_leaving {
    pub dev: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_acct_dev_leaving",
    ][::core::mem::size_of::<bch_acct_dev_leaving>() - 4usize];
    [
        "Alignment of bch_acct_dev_leaving",
    ][::core::mem::align_of::<bch_acct_dev_leaving>() - 1usize];
    [
        "Offset of field: bch_acct_dev_leaving::dev",
    ][::core::mem::offset_of!(bch_acct_dev_leaving, dev) - 0usize];
};
impl Default for bch_acct_dev_leaving {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct disk_accounting_pos {
    pub __bindgen_anon_1: disk_accounting_pos__bindgen_ty_1,
}
#[repr(C)]
pub struct disk_accounting_pos__bindgen_ty_1 {
    pub __bindgen_anon_1: __BindgenUnionField<
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1,
    >,
    pub _pad: __BindgenUnionField<bpos>,
    pub bindgen_union_field: [u32; 5usize],
}
#[repr(C, packed)]
pub struct disk_accounting_pos__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u8,
    pub __bindgen_anon_1: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C, packed)]
pub struct disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub nr_inodes: __BindgenUnionField<bch_acct_nr_inodes>,
    pub persistent_reserved: __BindgenUnionField<bch_acct_persistent_reserved>,
    pub replicas: __BindgenUnionField<bch_acct_replicas>,
    pub dev_data_type: __BindgenUnionField<bch_acct_dev_data_type>,
    pub compression: __BindgenUnionField<bch_acct_compression>,
    pub snapshot: __BindgenUnionField<bch_acct_snapshot>,
    pub btree: __BindgenUnionField<bch_acct_btree>,
    pub rebalance_work: __BindgenUnionField<bch_acct_rebalance_work>,
    pub inum: __BindgenUnionField<bch_acct_inum>,
    pub reconcile_work: __BindgenUnionField<bch_acct_reconcile_work>,
    pub dev_leaving: __BindgenUnionField<bch_acct_dev_leaving>,
    pub bindgen_union_field: [u8; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1",
    ][::core::mem::size_of::<
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    [
        "Alignment of disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1",
    ][::core::mem::align_of::<
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    >() - 1usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::nr_inodes",
    ][::core::mem::offset_of!(
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1, nr_inodes
    ) - 0usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::persistent_reserved",
    ][::core::mem::offset_of!(
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        persistent_reserved
    ) - 0usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::replicas",
    ][::core::mem::offset_of!(
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1, replicas
    ) - 0usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::dev_data_type",
    ][::core::mem::offset_of!(
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1, dev_data_type
    ) - 0usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::compression",
    ][::core::mem::offset_of!(
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1, compression
    ) - 0usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::snapshot",
    ][::core::mem::offset_of!(
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1, snapshot
    ) - 0usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::btree",
    ][::core::mem::offset_of!(
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1, btree
    ) - 0usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::rebalance_work",
    ][::core::mem::offset_of!(
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1, rebalance_work
    ) - 0usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::inum",
    ][::core::mem::offset_of!(
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1, inum
    ) - 0usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::reconcile_work",
    ][::core::mem::offset_of!(
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1, reconcile_work
    ) - 0usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::dev_leaving",
    ][::core::mem::offset_of!(
        disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1, dev_leaving
    ) - 0usize];
};
impl Default for disk_accounting_pos__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of disk_accounting_pos__bindgen_ty_1__bindgen_ty_1",
    ][::core::mem::size_of::<disk_accounting_pos__bindgen_ty_1__bindgen_ty_1>()
        - 9usize];
    [
        "Alignment of disk_accounting_pos__bindgen_ty_1__bindgen_ty_1",
    ][::core::mem::align_of::<disk_accounting_pos__bindgen_ty_1__bindgen_ty_1>()
        - 1usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1__bindgen_ty_1::type_",
    ][::core::mem::offset_of!(disk_accounting_pos__bindgen_ty_1__bindgen_ty_1, type_)
        - 0usize];
};
impl Default for disk_accounting_pos__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of disk_accounting_pos__bindgen_ty_1",
    ][::core::mem::size_of::<disk_accounting_pos__bindgen_ty_1>() - 20usize];
    [
        "Alignment of disk_accounting_pos__bindgen_ty_1",
    ][::core::mem::align_of::<disk_accounting_pos__bindgen_ty_1>() - 4usize];
    [
        "Offset of field: disk_accounting_pos__bindgen_ty_1::_pad",
    ][::core::mem::offset_of!(disk_accounting_pos__bindgen_ty_1, _pad) - 0usize];
};
impl Default for disk_accounting_pos__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of disk_accounting_pos",
    ][::core::mem::size_of::<disk_accounting_pos>() - 20usize];
    [
        "Alignment of disk_accounting_pos",
    ][::core::mem::align_of::<disk_accounting_pos>() - 4usize];
};
impl Default for disk_accounting_pos {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_disk_group {
    pub label: [__u8; 32usize],
    pub flags: [__le64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_disk_group"][::core::mem::size_of::<bch_disk_group>() - 48usize];
    ["Alignment of bch_disk_group"][::core::mem::align_of::<bch_disk_group>() - 8usize];
    [
        "Offset of field: bch_disk_group::label",
    ][::core::mem::offset_of!(bch_disk_group, label) - 0usize];
    [
        "Offset of field: bch_disk_group::flags",
    ][::core::mem::offset_of!(bch_disk_group, flags) - 32usize];
};
impl Default for bch_disk_group {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const BCH_GROUP_DELETED_OFFSET: ::core::ffi::c_uint = 0;
pub const BCH_GROUP_DELETED_BITS: ::core::ffi::c_uint = 1;
pub const BCH_GROUP_DELETED_MAX: __u64 = 1;
pub const BCH_GROUP_DATA_ALLOWED_OFFSET: ::core::ffi::c_uint = 1;
pub const BCH_GROUP_DATA_ALLOWED_BITS: ::core::ffi::c_uint = 5;
pub const BCH_GROUP_DATA_ALLOWED_MAX: __u64 = 31;
pub const BCH_GROUP_PARENT_OFFSET: ::core::ffi::c_uint = 6;
pub const BCH_GROUP_PARENT_BITS: ::core::ffi::c_uint = 18;
pub const BCH_GROUP_PARENT_MAX: __u64 = 262143;
#[repr(C, packed(8))]
pub struct bch_sb_field_disk_groups {
    pub field: bch_sb_field,
    pub entries: __IncompleteArrayField<bch_disk_group>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_sb_field_disk_groups",
    ][::core::mem::size_of::<bch_sb_field_disk_groups>() - 8usize];
    [
        "Alignment of bch_sb_field_disk_groups",
    ][::core::mem::align_of::<bch_sb_field_disk_groups>() - 8usize];
    [
        "Offset of field: bch_sb_field_disk_groups::field",
    ][::core::mem::offset_of!(bch_sb_field_disk_groups, field) - 0usize];
    [
        "Offset of field: bch_sb_field_disk_groups::entries",
    ][::core::mem::offset_of!(bch_sb_field_disk_groups, entries) - 8usize];
};
impl Default for bch_sb_field_disk_groups {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_lru {
    pub v: bch_val,
    pub idx: __le64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_lru"][::core::mem::size_of::<bch_lru>() - 8usize];
    ["Alignment of bch_lru"][::core::mem::align_of::<bch_lru>() - 8usize];
    ["Offset of field: bch_lru::v"][::core::mem::offset_of!(bch_lru, v) - 0usize];
    ["Offset of field: bch_lru::idx"][::core::mem::offset_of!(bch_lru, idx) - 0usize];
};
impl Default for bch_lru {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_lru_type {
    BCH_LRU_read = 0,
    BCH_LRU_fragmentation = 1,
    BCH_LRU_stripes = 2,
}
#[repr(C, packed(8))]
pub struct bch_alloc {
    pub v: bch_val,
    pub fields: __u8,
    pub generation: __u8,
    pub data: __IncompleteArrayField<__u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_alloc"][::core::mem::size_of::<bch_alloc>() - 8usize];
    ["Alignment of bch_alloc"][::core::mem::align_of::<bch_alloc>() - 8usize];
    ["Offset of field: bch_alloc::v"][::core::mem::offset_of!(bch_alloc, v) - 0usize];
    [
        "Offset of field: bch_alloc::fields",
    ][::core::mem::offset_of!(bch_alloc, fields) - 0usize];
    [
        "Offset of field: bch_alloc::generation",
    ][::core::mem::offset_of!(bch_alloc, generation) - 1usize];
    [
        "Offset of field: bch_alloc::data",
    ][::core::mem::offset_of!(bch_alloc, data) - 2usize];
};
impl Default for bch_alloc {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const BCH_ALLOC_FIELD_V1_read_time: _bindgen_ty_103 = _bindgen_ty_103::BCH_ALLOC_FIELD_V1_read_time;
pub const BCH_ALLOC_FIELD_V1_write_time: _bindgen_ty_103 = _bindgen_ty_103::BCH_ALLOC_FIELD_V1_write_time;
pub const BCH_ALLOC_FIELD_V1_data_type: _bindgen_ty_103 = _bindgen_ty_103::BCH_ALLOC_FIELD_V1_data_type;
pub const BCH_ALLOC_FIELD_V1_dirty_sectors: _bindgen_ty_103 = _bindgen_ty_103::BCH_ALLOC_FIELD_V1_dirty_sectors;
pub const BCH_ALLOC_FIELD_V1_cached_sectors: _bindgen_ty_103 = _bindgen_ty_103::BCH_ALLOC_FIELD_V1_cached_sectors;
pub const BCH_ALLOC_FIELD_V1_oldest_gen: _bindgen_ty_103 = _bindgen_ty_103::BCH_ALLOC_FIELD_V1_oldest_gen;
pub const BCH_ALLOC_FIELD_V1_stripe: _bindgen_ty_103 = _bindgen_ty_103::BCH_ALLOC_FIELD_V1_stripe;
pub const BCH_ALLOC_FIELD_V1_stripe_redundancy: _bindgen_ty_103 = _bindgen_ty_103::BCH_ALLOC_FIELD_V1_stripe_redundancy;
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_103 {
    BCH_ALLOC_FIELD_V1_read_time = 0,
    BCH_ALLOC_FIELD_V1_write_time = 1,
    BCH_ALLOC_FIELD_V1_data_type = 2,
    BCH_ALLOC_FIELD_V1_dirty_sectors = 3,
    BCH_ALLOC_FIELD_V1_cached_sectors = 4,
    BCH_ALLOC_FIELD_V1_oldest_gen = 5,
    BCH_ALLOC_FIELD_V1_stripe = 6,
    BCH_ALLOC_FIELD_V1_stripe_redundancy = 7,
}
#[repr(C, packed(8))]
pub struct bch_alloc_v2 {
    pub v: bch_val,
    pub nr_fields: __u8,
    pub generation: __u8,
    pub oldest_gen: __u8,
    pub data_type: __u8,
    pub data: __IncompleteArrayField<__u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_alloc_v2"][::core::mem::size_of::<bch_alloc_v2>() - 8usize];
    ["Alignment of bch_alloc_v2"][::core::mem::align_of::<bch_alloc_v2>() - 8usize];
    [
        "Offset of field: bch_alloc_v2::v",
    ][::core::mem::offset_of!(bch_alloc_v2, v) - 0usize];
    [
        "Offset of field: bch_alloc_v2::nr_fields",
    ][::core::mem::offset_of!(bch_alloc_v2, nr_fields) - 0usize];
    [
        "Offset of field: bch_alloc_v2::generation",
    ][::core::mem::offset_of!(bch_alloc_v2, generation) - 1usize];
    [
        "Offset of field: bch_alloc_v2::oldest_gen",
    ][::core::mem::offset_of!(bch_alloc_v2, oldest_gen) - 2usize];
    [
        "Offset of field: bch_alloc_v2::data_type",
    ][::core::mem::offset_of!(bch_alloc_v2, data_type) - 3usize];
    [
        "Offset of field: bch_alloc_v2::data",
    ][::core::mem::offset_of!(bch_alloc_v2, data) - 4usize];
};
impl Default for bch_alloc_v2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_alloc_v3 {
    pub v: bch_val,
    pub journal_seq: __le64,
    pub flags: __le32,
    pub nr_fields: __u8,
    pub generation: __u8,
    pub oldest_gen: __u8,
    pub data_type: __u8,
    pub data: __IncompleteArrayField<__u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_alloc_v3"][::core::mem::size_of::<bch_alloc_v3>() - 16usize];
    ["Alignment of bch_alloc_v3"][::core::mem::align_of::<bch_alloc_v3>() - 8usize];
    [
        "Offset of field: bch_alloc_v3::v",
    ][::core::mem::offset_of!(bch_alloc_v3, v) - 0usize];
    [
        "Offset of field: bch_alloc_v3::journal_seq",
    ][::core::mem::offset_of!(bch_alloc_v3, journal_seq) - 0usize];
    [
        "Offset of field: bch_alloc_v3::flags",
    ][::core::mem::offset_of!(bch_alloc_v3, flags) - 8usize];
    [
        "Offset of field: bch_alloc_v3::nr_fields",
    ][::core::mem::offset_of!(bch_alloc_v3, nr_fields) - 12usize];
    [
        "Offset of field: bch_alloc_v3::generation",
    ][::core::mem::offset_of!(bch_alloc_v3, generation) - 13usize];
    [
        "Offset of field: bch_alloc_v3::oldest_gen",
    ][::core::mem::offset_of!(bch_alloc_v3, oldest_gen) - 14usize];
    [
        "Offset of field: bch_alloc_v3::data_type",
    ][::core::mem::offset_of!(bch_alloc_v3, data_type) - 15usize];
    [
        "Offset of field: bch_alloc_v3::data",
    ][::core::mem::offset_of!(bch_alloc_v3, data) - 16usize];
};
impl Default for bch_alloc_v3 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const BCH_ALLOC_V3_NEED_DISCARD_OFFSET: ::core::ffi::c_uint = 0;
pub const BCH_ALLOC_V3_NEED_DISCARD_BITS: ::core::ffi::c_uint = 1;
pub const BCH_ALLOC_V3_NEED_DISCARD_MAX: __u32 = 1;
pub const BCH_ALLOC_V3_NEED_INC_GEN_OFFSET: ::core::ffi::c_uint = 1;
pub const BCH_ALLOC_V3_NEED_INC_GEN_BITS: ::core::ffi::c_uint = 1;
pub const BCH_ALLOC_V3_NEED_INC_GEN_MAX: __u32 = 1;
#[repr(C, packed(8))]
pub struct bch_alloc_v4 {
    pub v: bch_val,
    pub journal_seq_nonempty: __u64,
    pub flags: __u32,
    pub generation: __u8,
    pub oldest_gen: __u8,
    pub data_type: __u8,
    pub stripe_redundancy_obsolete: __u8,
    pub dirty_sectors: __u32,
    pub cached_sectors: __u32,
    pub io_time: [__u64; 2usize],
    pub stripe_refcount: __u32,
    pub nr_external_backpointers: __u32,
    pub journal_seq_empty: __u64,
    pub stripe_sectors: __u32,
    pub pad: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_alloc_v4"][::core::mem::size_of::<bch_alloc_v4>() - 64usize];
    ["Alignment of bch_alloc_v4"][::core::mem::align_of::<bch_alloc_v4>() - 8usize];
    [
        "Offset of field: bch_alloc_v4::v",
    ][::core::mem::offset_of!(bch_alloc_v4, v) - 0usize];
    [
        "Offset of field: bch_alloc_v4::journal_seq_nonempty",
    ][::core::mem::offset_of!(bch_alloc_v4, journal_seq_nonempty) - 0usize];
    [
        "Offset of field: bch_alloc_v4::flags",
    ][::core::mem::offset_of!(bch_alloc_v4, flags) - 8usize];
    [
        "Offset of field: bch_alloc_v4::generation",
    ][::core::mem::offset_of!(bch_alloc_v4, generation) - 12usize];
    [
        "Offset of field: bch_alloc_v4::oldest_gen",
    ][::core::mem::offset_of!(bch_alloc_v4, oldest_gen) - 13usize];
    [
        "Offset of field: bch_alloc_v4::data_type",
    ][::core::mem::offset_of!(bch_alloc_v4, data_type) - 14usize];
    [
        "Offset of field: bch_alloc_v4::stripe_redundancy_obsolete",
    ][::core::mem::offset_of!(bch_alloc_v4, stripe_redundancy_obsolete) - 15usize];
    [
        "Offset of field: bch_alloc_v4::dirty_sectors",
    ][::core::mem::offset_of!(bch_alloc_v4, dirty_sectors) - 16usize];
    [
        "Offset of field: bch_alloc_v4::cached_sectors",
    ][::core::mem::offset_of!(bch_alloc_v4, cached_sectors) - 20usize];
    [
        "Offset of field: bch_alloc_v4::io_time",
    ][::core::mem::offset_of!(bch_alloc_v4, io_time) - 24usize];
    [
        "Offset of field: bch_alloc_v4::stripe_refcount",
    ][::core::mem::offset_of!(bch_alloc_v4, stripe_refcount) - 40usize];
    [
        "Offset of field: bch_alloc_v4::nr_external_backpointers",
    ][::core::mem::offset_of!(bch_alloc_v4, nr_external_backpointers) - 44usize];
    [
        "Offset of field: bch_alloc_v4::journal_seq_empty",
    ][::core::mem::offset_of!(bch_alloc_v4, journal_seq_empty) - 48usize];
    [
        "Offset of field: bch_alloc_v4::stripe_sectors",
    ][::core::mem::offset_of!(bch_alloc_v4, stripe_sectors) - 56usize];
    [
        "Offset of field: bch_alloc_v4::pad",
    ][::core::mem::offset_of!(bch_alloc_v4, pad) - 60usize];
};
impl Default for bch_alloc_v4 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const BCH_ALLOC_V4_NEED_DISCARD_OFFSET: ::core::ffi::c_uint = 0;
pub const BCH_ALLOC_V4_NEED_DISCARD_BITS: ::core::ffi::c_uint = 1;
pub const BCH_ALLOC_V4_NEED_INC_GEN_OFFSET: ::core::ffi::c_uint = 1;
pub const BCH_ALLOC_V4_NEED_INC_GEN_BITS: ::core::ffi::c_uint = 1;
pub const BCH_ALLOC_V4_BACKPOINTERS_START_OFFSET: ::core::ffi::c_uint = 2;
pub const BCH_ALLOC_V4_BACKPOINTERS_START_BITS: ::core::ffi::c_uint = 6;
pub const BCH_ALLOC_V4_NR_BACKPOINTERS_OFFSET: ::core::ffi::c_uint = 8;
pub const BCH_ALLOC_V4_NR_BACKPOINTERS_BITS: ::core::ffi::c_uint = 6;
#[repr(C, packed(8))]
pub struct bch_bucket_gens {
    pub v: bch_val,
    pub gens: [u8_; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_bucket_gens"][::core::mem::size_of::<bch_bucket_gens>() - 256usize];
    [
        "Alignment of bch_bucket_gens",
    ][::core::mem::align_of::<bch_bucket_gens>() - 8usize];
    [
        "Offset of field: bch_bucket_gens::v",
    ][::core::mem::offset_of!(bch_bucket_gens, v) - 0usize];
    [
        "Offset of field: bch_bucket_gens::gens",
    ][::core::mem::offset_of!(bch_bucket_gens, gens) - 0usize];
};
impl Default for bch_bucket_gens {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_extent_entry_type {
    BCH_EXTENT_ENTRY_ptr = 0,
    BCH_EXTENT_ENTRY_crc32 = 1,
    BCH_EXTENT_ENTRY_crc64 = 2,
    BCH_EXTENT_ENTRY_crc128 = 3,
    BCH_EXTENT_ENTRY_stripe_ptr = 4,
    BCH_EXTENT_ENTRY_rebalance_v1 = 5,
    BCH_EXTENT_ENTRY_flags = 6,
    BCH_EXTENT_ENTRY_reconcile = 7,
    BCH_EXTENT_ENTRY_reconcile_bp = 8,
}
#[repr(C)]
#[repr(align(8))]
pub struct bch_extent_crc32 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub csum: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_extent_crc32"][::core::mem::size_of::<bch_extent_crc32>() - 8usize];
    [
        "Alignment of bch_extent_crc32",
    ][::core::mem::align_of::<bch_extent_crc32>() - 8usize];
    [
        "Offset of field: bch_extent_crc32::csum",
    ][::core::mem::offset_of!(bch_extent_crc32, csum) - 4usize];
};
impl Default for bch_extent_crc32 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bch_extent_crc32 {
    #[inline]
    pub fn type_(&self) -> __u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn type__raw(this: *const Self) -> __u32 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 4usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 2u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set_type_raw(this: *mut Self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 4usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _compressed_size(&self) -> __u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set__compressed_size(&mut self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _compressed_size_raw(this: *const Self) -> __u32 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 4usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 2usize, 7u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set__compressed_size_raw(this: *mut Self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 4usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _uncompressed_size(&self) -> __u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set__uncompressed_size(&mut self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _uncompressed_size_raw(this: *const Self) -> __u32 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 4usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 9usize, 7u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set__uncompressed_size_raw(this: *mut Self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 4usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn offset(&self) -> __u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set_offset(&mut self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn offset_raw(this: *const Self) -> __u32 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 4usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 16usize, 7u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set_offset_raw(this: *mut Self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 4usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _unused(&self) -> __u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set__unused(&mut self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _unused_raw(this: *const Self) -> __u32 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 4usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 23usize, 1u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set__unused_raw(this: *mut Self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 4usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                23usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn csum_type(&self) -> __u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_csum_type(&mut self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn csum_type_raw(this: *const Self) -> __u32 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 4usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 24usize, 4u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set_csum_type_raw(this: *mut Self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 4usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn compression_type(&self) -> __u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_compression_type(&mut self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn compression_type_raw(this: *const Self) -> __u32 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 4usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 28usize, 4u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set_compression_type_raw(this: *mut Self, val: __u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 4usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                28usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: __u32,
        _compressed_size: __u32,
        _uncompressed_size: __u32,
        offset: __u32,
        _unused: __u32,
        csum_type: __u32,
        compression_type: __u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                2u8,
                {
                    let type_: u32 = unsafe { ::core::mem::transmute(type_) };
                    type_ as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                2usize,
                7u8,
                {
                    let _compressed_size: u32 = unsafe {
                        ::core::mem::transmute(_compressed_size)
                    };
                    _compressed_size as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                9usize,
                7u8,
                {
                    let _uncompressed_size: u32 = unsafe {
                        ::core::mem::transmute(_uncompressed_size)
                    };
                    _uncompressed_size as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                16usize,
                7u8,
                {
                    let offset: u32 = unsafe { ::core::mem::transmute(offset) };
                    offset as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                23usize,
                1u8,
                {
                    let _unused: u32 = unsafe { ::core::mem::transmute(_unused) };
                    _unused as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                24usize,
                4u8,
                {
                    let csum_type: u32 = unsafe { ::core::mem::transmute(csum_type) };
                    csum_type as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                28usize,
                4u8,
                {
                    let compression_type: u32 = unsafe {
                        ::core::mem::transmute(compression_type)
                    };
                    compression_type as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed(8))]
pub struct bch_extent_crc64 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
    pub csum_lo: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_extent_crc64"][::core::mem::size_of::<bch_extent_crc64>() - 16usize];
    [
        "Alignment of bch_extent_crc64",
    ][::core::mem::align_of::<bch_extent_crc64>() - 8usize];
    [
        "Offset of field: bch_extent_crc64::csum_lo",
    ][::core::mem::offset_of!(bch_extent_crc64, csum_lo) - 8usize];
};
impl Default for bch_extent_crc64 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bch_extent_crc64 {
    #[inline]
    pub fn type_(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u64) }
    }
    #[inline]
    pub fn set_type(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn type__raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 3u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_type_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _compressed_size(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 9u8) as u64) }
    }
    #[inline]
    pub fn set__compressed_size(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _compressed_size_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 3usize, 9u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set__compressed_size_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _uncompressed_size(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 9u8) as u64) }
    }
    #[inline]
    pub fn set__uncompressed_size(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _uncompressed_size_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 12usize, 9u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set__uncompressed_size_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn offset(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 9u8) as u64) }
    }
    #[inline]
    pub fn set_offset(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(21usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn offset_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 21usize, 9u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_offset_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                21usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn nonce(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 10u8) as u64) }
    }
    #[inline]
    pub fn set_nonce(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn nonce_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 30usize, 10u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_nonce_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                10u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn csum_type(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(40usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_csum_type(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(40usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn csum_type_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 40usize, 4u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_csum_type_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                40usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn compression_type(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(44usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_compression_type(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(44usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn compression_type_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 44usize, 4u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_compression_type_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                44usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn csum_hi(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(48usize, 16u8) as u64) }
    }
    #[inline]
    pub fn set_csum_hi(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(48usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn csum_hi_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 48usize, 16u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_csum_hi_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                48usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: __u64,
        _compressed_size: __u64,
        _uncompressed_size: __u64,
        offset: __u64,
        nonce: __u64,
        csum_type: __u64,
        compression_type: __u64,
        csum_hi: __u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                3u8,
                {
                    let type_: u64 = unsafe { ::core::mem::transmute(type_) };
                    type_ as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                3usize,
                9u8,
                {
                    let _compressed_size: u64 = unsafe {
                        ::core::mem::transmute(_compressed_size)
                    };
                    _compressed_size as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                12usize,
                9u8,
                {
                    let _uncompressed_size: u64 = unsafe {
                        ::core::mem::transmute(_uncompressed_size)
                    };
                    _uncompressed_size as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                21usize,
                9u8,
                {
                    let offset: u64 = unsafe { ::core::mem::transmute(offset) };
                    offset as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                30usize,
                10u8,
                {
                    let nonce: u64 = unsafe { ::core::mem::transmute(nonce) };
                    nonce as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                40usize,
                4u8,
                {
                    let csum_type: u64 = unsafe { ::core::mem::transmute(csum_type) };
                    csum_type as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                44usize,
                4u8,
                {
                    let compression_type: u64 = unsafe {
                        ::core::mem::transmute(compression_type)
                    };
                    compression_type as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                48usize,
                16u8,
                {
                    let csum_hi: u64 = unsafe { ::core::mem::transmute(csum_hi) };
                    csum_hi as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed(8))]
pub struct bch_extent_crc128 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
    pub csum: bch_csum,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_extent_crc128"][::core::mem::size_of::<bch_extent_crc128>() - 24usize];
    [
        "Alignment of bch_extent_crc128",
    ][::core::mem::align_of::<bch_extent_crc128>() - 8usize];
    [
        "Offset of field: bch_extent_crc128::csum",
    ][::core::mem::offset_of!(bch_extent_crc128, csum) - 8usize];
};
impl Default for bch_extent_crc128 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bch_extent_crc128 {
    #[inline]
    pub fn type_(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_type(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn type__raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 4u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_type_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _compressed_size(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 13u8) as u64) }
    }
    #[inline]
    pub fn set__compressed_size(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 13u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _compressed_size_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 4usize, 13u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set__compressed_size_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                13u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _uncompressed_size(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 13u8) as u64) }
    }
    #[inline]
    pub fn set__uncompressed_size(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 13u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _uncompressed_size_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 17usize, 13u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set__uncompressed_size_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                17usize,
                13u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn offset(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 13u8) as u64) }
    }
    #[inline]
    pub fn set_offset(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 13u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn offset_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 30usize, 13u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_offset_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                13u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn nonce(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(43usize, 13u8) as u64) }
    }
    #[inline]
    pub fn set_nonce(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(43usize, 13u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn nonce_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 43usize, 13u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_nonce_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                43usize,
                13u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn csum_type(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(56usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_csum_type(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(56usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn csum_type_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 56usize, 4u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_csum_type_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                56usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn compression_type(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(60usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_compression_type(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(60usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn compression_type_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 60usize, 4u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_compression_type_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                60usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: __u64,
        _compressed_size: __u64,
        _uncompressed_size: __u64,
        offset: __u64,
        nonce: __u64,
        csum_type: __u64,
        compression_type: __u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                4u8,
                {
                    let type_: u64 = unsafe { ::core::mem::transmute(type_) };
                    type_ as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                4usize,
                13u8,
                {
                    let _compressed_size: u64 = unsafe {
                        ::core::mem::transmute(_compressed_size)
                    };
                    _compressed_size as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                17usize,
                13u8,
                {
                    let _uncompressed_size: u64 = unsafe {
                        ::core::mem::transmute(_uncompressed_size)
                    };
                    _uncompressed_size as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                30usize,
                13u8,
                {
                    let offset: u64 = unsafe { ::core::mem::transmute(offset) };
                    offset as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                43usize,
                13u8,
                {
                    let nonce: u64 = unsafe { ::core::mem::transmute(nonce) };
                    nonce as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                56usize,
                4u8,
                {
                    let csum_type: u64 = unsafe { ::core::mem::transmute(csum_type) };
                    csum_type as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                60usize,
                4u8,
                {
                    let compression_type: u64 = unsafe {
                        ::core::mem::transmute(compression_type)
                    };
                    compression_type as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(8))]
pub struct bch_extent_ptr {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_extent_ptr"][::core::mem::size_of::<bch_extent_ptr>() - 8usize];
    ["Alignment of bch_extent_ptr"][::core::mem::align_of::<bch_extent_ptr>() - 8usize];
};
impl Default for bch_extent_ptr {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bch_extent_ptr {
    #[inline]
    pub fn type_(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_type(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn type__raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_type_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn cached(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_cached(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn cached_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 1usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_cached_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn unused(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_unused(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn unused_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 2usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_unused_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn unwritten(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_unwritten(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn unwritten_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 3usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_unwritten_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn offset(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 44u8) as u64) }
    }
    #[inline]
    pub fn set_offset(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 44u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn offset_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 4usize, 44u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_offset_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                44u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn dev(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(48usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_dev(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(48usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn dev_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 48usize, 8u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_dev_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                48usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn generation(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(56usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_generation(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(56usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn generation_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 56usize, 8u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_generation_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                56usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: __u64,
        cached: __u64,
        unused: __u64,
        unwritten: __u64,
        offset: __u64,
        dev: __u64,
        generation: __u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                1u8,
                {
                    let type_: u64 = unsafe { ::core::mem::transmute(type_) };
                    type_ as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                1usize,
                1u8,
                {
                    let cached: u64 = unsafe { ::core::mem::transmute(cached) };
                    cached as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                2usize,
                1u8,
                {
                    let unused: u64 = unsafe { ::core::mem::transmute(unused) };
                    unused as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                3usize,
                1u8,
                {
                    let unwritten: u64 = unsafe { ::core::mem::transmute(unwritten) };
                    unwritten as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                4usize,
                44u8,
                {
                    let offset: u64 = unsafe { ::core::mem::transmute(offset) };
                    offset as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                48usize,
                8u8,
                {
                    let dev: u64 = unsafe { ::core::mem::transmute(dev) };
                    dev as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                56usize,
                8u8,
                {
                    let generation: u64 = unsafe { ::core::mem::transmute(generation) };
                    generation as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
pub struct bch_extent_stripe_ptr {
    pub _bitfield_align_1: [u64; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_extent_stripe_ptr",
    ][::core::mem::size_of::<bch_extent_stripe_ptr>() - 8usize];
    [
        "Alignment of bch_extent_stripe_ptr",
    ][::core::mem::align_of::<bch_extent_stripe_ptr>() - 8usize];
};
impl Default for bch_extent_stripe_ptr {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bch_extent_stripe_ptr {
    #[inline]
    pub fn type_(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u64) }
    }
    #[inline]
    pub fn set_type(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn type__raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 5u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_type_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn block(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_block(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn block_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 5usize, 8u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_block_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn redundancy(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_redundancy(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn redundancy_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 13usize, 4u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_redundancy_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn idx(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 47u8) as u64) }
    }
    #[inline]
    pub fn set_idx(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 47u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn idx_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 17usize, 47u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_idx_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                17usize,
                47u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: __u64,
        block: __u64,
        redundancy: __u64,
        idx: __u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                5u8,
                {
                    let type_: u64 = unsafe { ::core::mem::transmute(type_) };
                    type_ as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                5usize,
                8u8,
                {
                    let block: u64 = unsafe { ::core::mem::transmute(block) };
                    block as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                13usize,
                4u8,
                {
                    let redundancy: u64 = unsafe { ::core::mem::transmute(redundancy) };
                    redundancy as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                17usize,
                47u8,
                {
                    let idx: u64 = unsafe { ::core::mem::transmute(idx) };
                    idx as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_extent_flags_e {
    BCH_EXTENT_FLAG_poisoned = 0,
}
#[repr(C)]
pub struct bch_extent_flags {
    pub _bitfield_align_1: [u64; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_extent_flags"][::core::mem::size_of::<bch_extent_flags>() - 8usize];
    [
        "Alignment of bch_extent_flags",
    ][::core::mem::align_of::<bch_extent_flags>() - 8usize];
};
impl Default for bch_extent_flags {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bch_extent_flags {
    #[inline]
    pub fn type_(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u64) }
    }
    #[inline]
    pub fn set_type(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn type__raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 7u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_type_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn flags(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 57u8) as u64) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 57u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn flags_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 7usize, 57u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_flags_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                57u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: __u64,
        flags: __u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                7u8,
                {
                    let type_: u64 = unsafe { ::core::mem::transmute(type_) };
                    type_ as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                7usize,
                57u8,
                {
                    let flags: u64 = unsafe { ::core::mem::transmute(flags) };
                    flags as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(8))]
pub struct bch_extent_rebalance_v1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_extent_rebalance_v1",
    ][::core::mem::size_of::<bch_extent_rebalance_v1>() - 8usize];
    [
        "Alignment of bch_extent_rebalance_v1",
    ][::core::mem::align_of::<bch_extent_rebalance_v1>() - 8usize];
};
impl Default for bch_extent_rebalance_v1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bch_extent_rebalance_v1 {
    #[inline]
    pub fn type_(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 6u8) as u64) }
    }
    #[inline]
    pub fn set_type(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn type__raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 6u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_type_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                6u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn unused(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 3u8) as u64) }
    }
    #[inline]
    pub fn set_unused(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn unused_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 6usize, 3u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_unused_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn promote_target_from_inode(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_promote_target_from_inode(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn promote_target_from_inode_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 9usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_promote_target_from_inode_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn erasure_code_from_inode(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_erasure_code_from_inode(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn erasure_code_from_inode_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 10usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_erasure_code_from_inode_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn data_checksum_from_inode(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_data_checksum_from_inode(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn data_checksum_from_inode_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 11usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_data_checksum_from_inode_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn background_compression_from_inode(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_background_compression_from_inode(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn background_compression_from_inode_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 12usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_background_compression_from_inode_raw(
        this: *mut Self,
        val: __u64,
    ) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn data_replicas_from_inode(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_data_replicas_from_inode(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn data_replicas_from_inode_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 13usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_data_replicas_from_inode_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn background_target_from_inode(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_background_target_from_inode(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn background_target_from_inode_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 14usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_background_target_from_inode_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn promote_target(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 16u8) as u64) }
    }
    #[inline]
    pub fn set_promote_target(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn promote_target_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 15usize, 16u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_promote_target_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn erasure_code(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_erasure_code(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn erasure_code_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 31usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_erasure_code_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn data_checksum(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(32usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_data_checksum(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(32usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn data_checksum_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 32usize, 4u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_data_checksum_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                32usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn data_replicas(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(36usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_data_replicas(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(36usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn data_replicas_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 36usize, 4u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_data_replicas_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                36usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn background_compression(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(40usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_background_compression(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(40usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn background_compression_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 40usize, 8u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_background_compression_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                40usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn background_target(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(48usize, 16u8) as u64) }
    }
    #[inline]
    pub fn set_background_target(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(48usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn background_target_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 48usize, 16u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_background_target_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                48usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: __u64,
        unused: __u64,
        promote_target_from_inode: __u64,
        erasure_code_from_inode: __u64,
        data_checksum_from_inode: __u64,
        background_compression_from_inode: __u64,
        data_replicas_from_inode: __u64,
        background_target_from_inode: __u64,
        promote_target: __u64,
        erasure_code: __u64,
        data_checksum: __u64,
        data_replicas: __u64,
        background_compression: __u64,
        background_target: __u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                6u8,
                {
                    let type_: u64 = unsafe { ::core::mem::transmute(type_) };
                    type_ as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                6usize,
                3u8,
                {
                    let unused: u64 = unsafe { ::core::mem::transmute(unused) };
                    unused as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                9usize,
                1u8,
                {
                    let promote_target_from_inode: u64 = unsafe {
                        ::core::mem::transmute(promote_target_from_inode)
                    };
                    promote_target_from_inode as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                10usize,
                1u8,
                {
                    let erasure_code_from_inode: u64 = unsafe {
                        ::core::mem::transmute(erasure_code_from_inode)
                    };
                    erasure_code_from_inode as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                11usize,
                1u8,
                {
                    let data_checksum_from_inode: u64 = unsafe {
                        ::core::mem::transmute(data_checksum_from_inode)
                    };
                    data_checksum_from_inode as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                12usize,
                1u8,
                {
                    let background_compression_from_inode: u64 = unsafe {
                        ::core::mem::transmute(background_compression_from_inode)
                    };
                    background_compression_from_inode as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                13usize,
                1u8,
                {
                    let data_replicas_from_inode: u64 = unsafe {
                        ::core::mem::transmute(data_replicas_from_inode)
                    };
                    data_replicas_from_inode as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                14usize,
                1u8,
                {
                    let background_target_from_inode: u64 = unsafe {
                        ::core::mem::transmute(background_target_from_inode)
                    };
                    background_target_from_inode as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                15usize,
                16u8,
                {
                    let promote_target: u64 = unsafe {
                        ::core::mem::transmute(promote_target)
                    };
                    promote_target as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                31usize,
                1u8,
                {
                    let erasure_code: u64 = unsafe {
                        ::core::mem::transmute(erasure_code)
                    };
                    erasure_code as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                32usize,
                4u8,
                {
                    let data_checksum: u64 = unsafe {
                        ::core::mem::transmute(data_checksum)
                    };
                    data_checksum as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                36usize,
                4u8,
                {
                    let data_replicas: u64 = unsafe {
                        ::core::mem::transmute(data_replicas)
                    };
                    data_replicas as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                40usize,
                8u8,
                {
                    let background_compression: u64 = unsafe {
                        ::core::mem::transmute(background_compression)
                    };
                    background_compression as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                48usize,
                16u8,
                {
                    let background_target: u64 = unsafe {
                        ::core::mem::transmute(background_target)
                    };
                    background_target as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(8))]
pub struct bch_extent_reconcile {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_extent_reconcile",
    ][::core::mem::size_of::<bch_extent_reconcile>() - 8usize];
    [
        "Alignment of bch_extent_reconcile",
    ][::core::mem::align_of::<bch_extent_reconcile>() - 8usize];
};
impl Default for bch_extent_reconcile {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bch_extent_reconcile {
    #[inline]
    pub fn type_(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_type(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn type__raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 8u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_type_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn unused(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 2u8) as u64) }
    }
    #[inline]
    pub fn set_unused(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn unused_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 8usize, 2u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_unused_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ptrs_moving(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 5u8) as u64) }
    }
    #[inline]
    pub fn set_ptrs_moving(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ptrs_moving_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 10usize, 5u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_ptrs_moving_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hipri(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_hipri(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hipri_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 15usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_hipri_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn pending(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_pending(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn pending_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 16usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_pending_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn need_rb(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 5u8) as u64) }
    }
    #[inline]
    pub fn set_need_rb(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn need_rb_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 17usize, 5u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_need_rb_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                17usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn data_replicas_from_inode(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_data_replicas_from_inode(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn data_replicas_from_inode_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 22usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_data_replicas_from_inode_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                22usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn data_checksum_from_inode(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_data_checksum_from_inode(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn data_checksum_from_inode_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 23usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_data_checksum_from_inode_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                23usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn erasure_code_from_inode(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_erasure_code_from_inode(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn erasure_code_from_inode_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 24usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_erasure_code_from_inode_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn background_compression_from_inode(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_background_compression_from_inode(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn background_compression_from_inode_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 25usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_background_compression_from_inode_raw(
        this: *mut Self,
        val: __u64,
    ) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                25usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn background_target_from_inode(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(26usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_background_target_from_inode(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(26usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn background_target_from_inode_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 26usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_background_target_from_inode_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                26usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn promote_target_from_inode(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_promote_target_from_inode(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn promote_target_from_inode_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 27usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_promote_target_from_inode_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                27usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn data_replicas(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 3u8) as u64) }
    }
    #[inline]
    pub fn set_data_replicas(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn data_replicas_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 28usize, 3u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_data_replicas_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                28usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn data_checksum(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_data_checksum(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn data_checksum_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 31usize, 4u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_data_checksum_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn erasure_code(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(35usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_erasure_code(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(35usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn erasure_code_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 35usize, 1u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_erasure_code_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                35usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn background_compression(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(36usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_background_compression(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(36usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn background_compression_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 36usize, 8u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_background_compression_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                36usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn background_target(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(44usize, 10u8) as u64) }
    }
    #[inline]
    pub fn set_background_target(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(44usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn background_target_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 44usize, 10u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_background_target_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                44usize,
                10u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn promote_target(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(54usize, 10u8) as u64) }
    }
    #[inline]
    pub fn set_promote_target(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(54usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn promote_target_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 54usize, 10u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_promote_target_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                54usize,
                10u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: __u64,
        unused: __u64,
        ptrs_moving: __u64,
        hipri: __u64,
        pending: __u64,
        need_rb: __u64,
        data_replicas_from_inode: __u64,
        data_checksum_from_inode: __u64,
        erasure_code_from_inode: __u64,
        background_compression_from_inode: __u64,
        background_target_from_inode: __u64,
        promote_target_from_inode: __u64,
        data_replicas: __u64,
        data_checksum: __u64,
        erasure_code: __u64,
        background_compression: __u64,
        background_target: __u64,
        promote_target: __u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                8u8,
                {
                    let type_: u64 = unsafe { ::core::mem::transmute(type_) };
                    type_ as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                8usize,
                2u8,
                {
                    let unused: u64 = unsafe { ::core::mem::transmute(unused) };
                    unused as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                10usize,
                5u8,
                {
                    let ptrs_moving: u64 = unsafe {
                        ::core::mem::transmute(ptrs_moving)
                    };
                    ptrs_moving as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                15usize,
                1u8,
                {
                    let hipri: u64 = unsafe { ::core::mem::transmute(hipri) };
                    hipri as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                16usize,
                1u8,
                {
                    let pending: u64 = unsafe { ::core::mem::transmute(pending) };
                    pending as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                17usize,
                5u8,
                {
                    let need_rb: u64 = unsafe { ::core::mem::transmute(need_rb) };
                    need_rb as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                22usize,
                1u8,
                {
                    let data_replicas_from_inode: u64 = unsafe {
                        ::core::mem::transmute(data_replicas_from_inode)
                    };
                    data_replicas_from_inode as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                23usize,
                1u8,
                {
                    let data_checksum_from_inode: u64 = unsafe {
                        ::core::mem::transmute(data_checksum_from_inode)
                    };
                    data_checksum_from_inode as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                24usize,
                1u8,
                {
                    let erasure_code_from_inode: u64 = unsafe {
                        ::core::mem::transmute(erasure_code_from_inode)
                    };
                    erasure_code_from_inode as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                25usize,
                1u8,
                {
                    let background_compression_from_inode: u64 = unsafe {
                        ::core::mem::transmute(background_compression_from_inode)
                    };
                    background_compression_from_inode as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                26usize,
                1u8,
                {
                    let background_target_from_inode: u64 = unsafe {
                        ::core::mem::transmute(background_target_from_inode)
                    };
                    background_target_from_inode as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                27usize,
                1u8,
                {
                    let promote_target_from_inode: u64 = unsafe {
                        ::core::mem::transmute(promote_target_from_inode)
                    };
                    promote_target_from_inode as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                28usize,
                3u8,
                {
                    let data_replicas: u64 = unsafe {
                        ::core::mem::transmute(data_replicas)
                    };
                    data_replicas as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                31usize,
                4u8,
                {
                    let data_checksum: u64 = unsafe {
                        ::core::mem::transmute(data_checksum)
                    };
                    data_checksum as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                35usize,
                1u8,
                {
                    let erasure_code: u64 = unsafe {
                        ::core::mem::transmute(erasure_code)
                    };
                    erasure_code as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                36usize,
                8u8,
                {
                    let background_compression: u64 = unsafe {
                        ::core::mem::transmute(background_compression)
                    };
                    background_compression as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                44usize,
                10u8,
                {
                    let background_target: u64 = unsafe {
                        ::core::mem::transmute(background_target)
                    };
                    background_target as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                54usize,
                10u8,
                {
                    let promote_target: u64 = unsafe {
                        ::core::mem::transmute(promote_target)
                    };
                    promote_target as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
pub struct bch_extent_reconcile_bp {
    pub _bitfield_align_1: [u64; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_extent_reconcile_bp",
    ][::core::mem::size_of::<bch_extent_reconcile_bp>() - 8usize];
    [
        "Alignment of bch_extent_reconcile_bp",
    ][::core::mem::align_of::<bch_extent_reconcile_bp>() - 8usize];
};
impl Default for bch_extent_reconcile_bp {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bch_extent_reconcile_bp {
    #[inline]
    pub fn type_(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u64) }
    }
    #[inline]
    pub fn set_type(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn type__raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 9u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_type_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn idx(&self) -> __u64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 55u8) as u64) }
    }
    #[inline]
    pub fn set_idx(&mut self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 55u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn idx_raw(this: *const Self) -> __u64 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 8usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 9usize, 55u8)
                    as u64,
            )
        }
    }
    #[inline]
    pub unsafe fn set_idx_raw(this: *mut Self, val: __u64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 8usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                55u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: __u64,
        idx: __u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                9u8,
                {
                    let type_: u64 = unsafe { ::core::mem::transmute(type_) };
                    type_ as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                9usize,
                55u8,
                {
                    let idx: u64 = unsafe { ::core::mem::transmute(idx) };
                    idx as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_reconcile_opts {
    BCH_RECONCILE_data_replicas = 0,
    BCH_RECONCILE_data_checksum = 1,
    BCH_RECONCILE_erasure_code = 2,
    BCH_RECONCILE_background_compression = 3,
    BCH_RECONCILE_background_target = 4,
    BCH_RECONCILE_promote_target = 5,
}
impl bch_reconcile_accounting_type {
    pub const BCH_RECONCILE_ACCOUNTING_replicas: bch_reconcile_accounting_type = bch_reconcile_accounting_type(
        0,
    );
    pub const BCH_RECONCILE_ACCOUNTING_checksum: bch_reconcile_accounting_type = bch_reconcile_accounting_type(
        1,
    );
    pub const BCH_RECONCILE_ACCOUNTING_erasure_code: bch_reconcile_accounting_type = bch_reconcile_accounting_type(
        2,
    );
    pub const BCH_RECONCILE_ACCOUNTING_compression: bch_reconcile_accounting_type = bch_reconcile_accounting_type(
        3,
    );
    pub const BCH_RECONCILE_ACCOUNTING_target: bch_reconcile_accounting_type = bch_reconcile_accounting_type(
        4,
    );
    pub const BCH_RECONCILE_ACCOUNTING_high_priority: bch_reconcile_accounting_type = bch_reconcile_accounting_type(
        5,
    );
    pub const BCH_RECONCILE_ACCOUNTING_pending: bch_reconcile_accounting_type = bch_reconcile_accounting_type(
        6,
    );
    pub const BCH_RECONCILE_ACCOUNTING_stripes: bch_reconcile_accounting_type = bch_reconcile_accounting_type(
        7,
    );
    pub const BCH_RECONCILE_ACCOUNTING_NR: bch_reconcile_accounting_type = bch_reconcile_accounting_type(
        8,
    );
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct bch_reconcile_accounting_type(pub ::core::ffi::c_uint);
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum reconcile_work_id {
    RECONCILE_WORK_none = 0,
    RECONCILE_WORK_hipri = 1,
    RECONCILE_WORK_normal = 2,
    RECONCILE_WORK_pending = 3,
}
#[repr(C)]
pub struct bch_extent_entry {
    pub type_: __BindgenUnionField<::core::ffi::c_ulong>,
    pub ptr: __BindgenUnionField<bch_extent_ptr>,
    pub crc32: __BindgenUnionField<bch_extent_crc32>,
    pub crc64: __BindgenUnionField<bch_extent_crc64>,
    pub crc128: __BindgenUnionField<bch_extent_crc128>,
    pub stripe_ptr: __BindgenUnionField<bch_extent_stripe_ptr>,
    pub rebalance_v1: __BindgenUnionField<bch_extent_rebalance_v1>,
    pub flags: __BindgenUnionField<bch_extent_flags>,
    pub reconcile: __BindgenUnionField<bch_extent_reconcile>,
    pub reconcile_bp: __BindgenUnionField<bch_extent_reconcile_bp>,
    pub bindgen_union_field: [u64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_extent_entry"][::core::mem::size_of::<bch_extent_entry>() - 24usize];
    [
        "Alignment of bch_extent_entry",
    ][::core::mem::align_of::<bch_extent_entry>() - 8usize];
    [
        "Offset of field: bch_extent_entry::type_",
    ][::core::mem::offset_of!(bch_extent_entry, type_) - 0usize];
    [
        "Offset of field: bch_extent_entry::ptr",
    ][::core::mem::offset_of!(bch_extent_entry, ptr) - 0usize];
    [
        "Offset of field: bch_extent_entry::crc32",
    ][::core::mem::offset_of!(bch_extent_entry, crc32) - 0usize];
    [
        "Offset of field: bch_extent_entry::crc64",
    ][::core::mem::offset_of!(bch_extent_entry, crc64) - 0usize];
    [
        "Offset of field: bch_extent_entry::crc128",
    ][::core::mem::offset_of!(bch_extent_entry, crc128) - 0usize];
    [
        "Offset of field: bch_extent_entry::stripe_ptr",
    ][::core::mem::offset_of!(bch_extent_entry, stripe_ptr) - 0usize];
    [
        "Offset of field: bch_extent_entry::rebalance_v1",
    ][::core::mem::offset_of!(bch_extent_entry, rebalance_v1) - 0usize];
    [
        "Offset of field: bch_extent_entry::flags",
    ][::core::mem::offset_of!(bch_extent_entry, flags) - 0usize];
    [
        "Offset of field: bch_extent_entry::reconcile",
    ][::core::mem::offset_of!(bch_extent_entry, reconcile) - 0usize];
    [
        "Offset of field: bch_extent_entry::reconcile_bp",
    ][::core::mem::offset_of!(bch_extent_entry, reconcile_bp) - 0usize];
};
impl Default for bch_extent_entry {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_btree_ptr {
    pub v: bch_val,
    pub _data: __IncompleteArrayField<__u64>,
    pub start: __IncompleteArrayField<bch_extent_ptr>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_btree_ptr"][::core::mem::size_of::<bch_btree_ptr>() - 0usize];
    ["Alignment of bch_btree_ptr"][::core::mem::align_of::<bch_btree_ptr>() - 8usize];
    [
        "Offset of field: bch_btree_ptr::v",
    ][::core::mem::offset_of!(bch_btree_ptr, v) - 0usize];
    [
        "Offset of field: bch_btree_ptr::_data",
    ][::core::mem::offset_of!(bch_btree_ptr, _data) - 0usize];
    [
        "Offset of field: bch_btree_ptr::start",
    ][::core::mem::offset_of!(bch_btree_ptr, start) - 0usize];
};
impl Default for bch_btree_ptr {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_btree_ptr_v2 {
    pub v: bch_val,
    pub mem_ptr: __u64,
    pub seq: __le64,
    pub sectors_written: __le16,
    pub flags: __le16,
    pub min_key: bpos,
    pub _data: __IncompleteArrayField<__u64>,
    pub start: __IncompleteArrayField<bch_extent_ptr>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_btree_ptr_v2"][::core::mem::size_of::<bch_btree_ptr_v2>() - 40usize];
    [
        "Alignment of bch_btree_ptr_v2",
    ][::core::mem::align_of::<bch_btree_ptr_v2>() - 8usize];
    [
        "Offset of field: bch_btree_ptr_v2::v",
    ][::core::mem::offset_of!(bch_btree_ptr_v2, v) - 0usize];
    [
        "Offset of field: bch_btree_ptr_v2::mem_ptr",
    ][::core::mem::offset_of!(bch_btree_ptr_v2, mem_ptr) - 0usize];
    [
        "Offset of field: bch_btree_ptr_v2::seq",
    ][::core::mem::offset_of!(bch_btree_ptr_v2, seq) - 8usize];
    [
        "Offset of field: bch_btree_ptr_v2::sectors_written",
    ][::core::mem::offset_of!(bch_btree_ptr_v2, sectors_written) - 16usize];
    [
        "Offset of field: bch_btree_ptr_v2::flags",
    ][::core::mem::offset_of!(bch_btree_ptr_v2, flags) - 18usize];
    [
        "Offset of field: bch_btree_ptr_v2::min_key",
    ][::core::mem::offset_of!(bch_btree_ptr_v2, min_key) - 20usize];
    [
        "Offset of field: bch_btree_ptr_v2::_data",
    ][::core::mem::offset_of!(bch_btree_ptr_v2, _data) - 40usize];
    [
        "Offset of field: bch_btree_ptr_v2::start",
    ][::core::mem::offset_of!(bch_btree_ptr_v2, start) - 40usize];
};
impl Default for bch_btree_ptr_v2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_extent {
    pub v: bch_val,
    pub _data: __IncompleteArrayField<__u64>,
    pub start: __IncompleteArrayField<bch_extent_entry>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_extent"][::core::mem::size_of::<bch_extent>() - 0usize];
    ["Alignment of bch_extent"][::core::mem::align_of::<bch_extent>() - 8usize];
    ["Offset of field: bch_extent::v"][::core::mem::offset_of!(bch_extent, v) - 0usize];
    [
        "Offset of field: bch_extent::_data",
    ][::core::mem::offset_of!(bch_extent, _data) - 0usize];
    [
        "Offset of field: bch_extent::start",
    ][::core::mem::offset_of!(bch_extent, start) - 0usize];
};
impl Default for bch_extent {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_reservation {
    pub v: bch_val,
    pub generation: __le32,
    pub nr_replicas: __u8,
    pub pad: [__u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_reservation"][::core::mem::size_of::<bch_reservation>() - 8usize];
    [
        "Alignment of bch_reservation",
    ][::core::mem::align_of::<bch_reservation>() - 8usize];
    [
        "Offset of field: bch_reservation::v",
    ][::core::mem::offset_of!(bch_reservation, v) - 0usize];
    [
        "Offset of field: bch_reservation::generation",
    ][::core::mem::offset_of!(bch_reservation, generation) - 0usize];
    [
        "Offset of field: bch_reservation::nr_replicas",
    ][::core::mem::offset_of!(bch_reservation, nr_replicas) - 4usize];
    [
        "Offset of field: bch_reservation::pad",
    ][::core::mem::offset_of!(bch_reservation, pad) - 5usize];
};
impl Default for bch_reservation {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_inline_data {
    pub v: bch_val,
    pub data: __IncompleteArrayField<u8_>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_inline_data"][::core::mem::size_of::<bch_inline_data>() - 0usize];
    [
        "Alignment of bch_inline_data",
    ][::core::mem::align_of::<bch_inline_data>() - 8usize];
    [
        "Offset of field: bch_inline_data::v",
    ][::core::mem::offset_of!(bch_inline_data, v) - 0usize];
    [
        "Offset of field: bch_inline_data::data",
    ][::core::mem::offset_of!(bch_inline_data, data) - 0usize];
};
impl Default for bch_inline_data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_stripe {
    pub v: bch_val,
    pub sectors: __le16,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub nr_blocks: __u8,
    pub nr_redundant: __u8,
    pub csum_granularity_bits: __u8,
    pub csum_type: __u8,
    pub disk_label: __u8,
    pub ptrs: __IncompleteArrayField<bch_extent_ptr>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_stripe"][::core::mem::size_of::<bch_stripe>() - 8usize];
    ["Alignment of bch_stripe"][::core::mem::align_of::<bch_stripe>() - 8usize];
    ["Offset of field: bch_stripe::v"][::core::mem::offset_of!(bch_stripe, v) - 0usize];
    [
        "Offset of field: bch_stripe::sectors",
    ][::core::mem::offset_of!(bch_stripe, sectors) - 0usize];
    [
        "Offset of field: bch_stripe::nr_blocks",
    ][::core::mem::offset_of!(bch_stripe, nr_blocks) - 3usize];
    [
        "Offset of field: bch_stripe::nr_redundant",
    ][::core::mem::offset_of!(bch_stripe, nr_redundant) - 4usize];
    [
        "Offset of field: bch_stripe::csum_granularity_bits",
    ][::core::mem::offset_of!(bch_stripe, csum_granularity_bits) - 5usize];
    [
        "Offset of field: bch_stripe::csum_type",
    ][::core::mem::offset_of!(bch_stripe, csum_type) - 6usize];
    [
        "Offset of field: bch_stripe::disk_label",
    ][::core::mem::offset_of!(bch_stripe, disk_label) - 7usize];
    [
        "Offset of field: bch_stripe::ptrs",
    ][::core::mem::offset_of!(bch_stripe, ptrs) - 8usize];
};
impl Default for bch_stripe {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bch_stripe {
    #[inline]
    pub fn algorithm(&self) -> __u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_algorithm(&mut self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn algorithm_raw(this: *const Self) -> __u8 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 4u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_algorithm_raw(this: *mut Self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn needs_reconcile(&self) -> __u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_needs_reconcile(&mut self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn needs_reconcile_raw(this: *const Self) -> __u8 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 4usize, 1u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_needs_reconcile_raw(this: *mut Self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn can_widen(&self) -> __u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_can_widen(&mut self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn can_widen_raw(this: *const Self) -> __u8 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 5usize, 3u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_can_widen_raw(this: *mut Self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        algorithm: __u8,
        needs_reconcile: __u8,
        can_widen: __u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                4u8,
                {
                    let algorithm: u8 = unsafe { ::core::mem::transmute(algorithm) };
                    algorithm as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                4usize,
                1u8,
                {
                    let needs_reconcile: u8 = unsafe {
                        ::core::mem::transmute(needs_reconcile)
                    };
                    needs_reconcile as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                5usize,
                3u8,
                {
                    let can_widen: u8 = unsafe { ::core::mem::transmute(can_widen) };
                    can_widen as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
pub struct bch_sb_field_extent_type_u64s {
    pub field: bch_sb_field,
    pub d: __IncompleteArrayField<u8_>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_sb_field_extent_type_u64s",
    ][::core::mem::size_of::<bch_sb_field_extent_type_u64s>() - 8usize];
    [
        "Alignment of bch_sb_field_extent_type_u64s",
    ][::core::mem::align_of::<bch_sb_field_extent_type_u64s>() - 8usize];
    [
        "Offset of field: bch_sb_field_extent_type_u64s::field",
    ][::core::mem::offset_of!(bch_sb_field_extent_type_u64s, field) - 0usize];
    [
        "Offset of field: bch_sb_field_extent_type_u64s::d",
    ][::core::mem::offset_of!(bch_sb_field_extent_type_u64s, d) - 8usize];
};
impl Default for bch_sb_field_extent_type_u64s {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_reflink_p {
    pub v: bch_val,
    pub idx_flags: __le64,
    pub front_pad: __le32,
    pub back_pad: __le32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_reflink_p"][::core::mem::size_of::<bch_reflink_p>() - 16usize];
    ["Alignment of bch_reflink_p"][::core::mem::align_of::<bch_reflink_p>() - 8usize];
    [
        "Offset of field: bch_reflink_p::v",
    ][::core::mem::offset_of!(bch_reflink_p, v) - 0usize];
    [
        "Offset of field: bch_reflink_p::idx_flags",
    ][::core::mem::offset_of!(bch_reflink_p, idx_flags) - 0usize];
    [
        "Offset of field: bch_reflink_p::front_pad",
    ][::core::mem::offset_of!(bch_reflink_p, front_pad) - 8usize];
    [
        "Offset of field: bch_reflink_p::back_pad",
    ][::core::mem::offset_of!(bch_reflink_p, back_pad) - 12usize];
};
impl Default for bch_reflink_p {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_reflink_v {
    pub v: bch_val,
    pub refcount: __le64,
    pub start: __IncompleteArrayField<bch_extent_entry>,
    pub _data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_reflink_v"][::core::mem::size_of::<bch_reflink_v>() - 8usize];
    ["Alignment of bch_reflink_v"][::core::mem::align_of::<bch_reflink_v>() - 8usize];
    [
        "Offset of field: bch_reflink_v::v",
    ][::core::mem::offset_of!(bch_reflink_v, v) - 0usize];
    [
        "Offset of field: bch_reflink_v::refcount",
    ][::core::mem::offset_of!(bch_reflink_v, refcount) - 0usize];
    [
        "Offset of field: bch_reflink_v::start",
    ][::core::mem::offset_of!(bch_reflink_v, start) - 8usize];
    [
        "Offset of field: bch_reflink_v::_data",
    ][::core::mem::offset_of!(bch_reflink_v, _data) - 8usize];
};
impl Default for bch_reflink_v {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_indirect_inline_data {
    pub v: bch_val,
    pub refcount: __le64,
    pub data: __IncompleteArrayField<u8_>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_indirect_inline_data",
    ][::core::mem::size_of::<bch_indirect_inline_data>() - 8usize];
    [
        "Alignment of bch_indirect_inline_data",
    ][::core::mem::align_of::<bch_indirect_inline_data>() - 8usize];
    [
        "Offset of field: bch_indirect_inline_data::v",
    ][::core::mem::offset_of!(bch_indirect_inline_data, v) - 0usize];
    [
        "Offset of field: bch_indirect_inline_data::refcount",
    ][::core::mem::offset_of!(bch_indirect_inline_data, refcount) - 0usize];
    [
        "Offset of field: bch_indirect_inline_data::data",
    ][::core::mem::offset_of!(bch_indirect_inline_data, data) - 8usize];
};
impl Default for bch_indirect_inline_data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_dirent {
    pub v: bch_val,
    pub __bindgen_anon_1: bch_dirent__bindgen_ty_1,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_anon_2: bch_dirent__bindgen_ty_2,
}
#[repr(C)]
pub struct bch_dirent__bindgen_ty_1 {
    pub d_inum: __BindgenUnionField<__le64>,
    pub __bindgen_anon_1: __BindgenUnionField<bch_dirent__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
pub struct bch_dirent__bindgen_ty_1__bindgen_ty_1 {
    pub d_child_subvol: __le32,
    pub d_parent_subvol: __le32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_dirent__bindgen_ty_1__bindgen_ty_1",
    ][::core::mem::size_of::<bch_dirent__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    [
        "Alignment of bch_dirent__bindgen_ty_1__bindgen_ty_1",
    ][::core::mem::align_of::<bch_dirent__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    [
        "Offset of field: bch_dirent__bindgen_ty_1__bindgen_ty_1::d_child_subvol",
    ][::core::mem::offset_of!(bch_dirent__bindgen_ty_1__bindgen_ty_1, d_child_subvol)
        - 0usize];
    [
        "Offset of field: bch_dirent__bindgen_ty_1__bindgen_ty_1::d_parent_subvol",
    ][::core::mem::offset_of!(bch_dirent__bindgen_ty_1__bindgen_ty_1, d_parent_subvol)
        - 4usize];
};
impl Default for bch_dirent__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_dirent__bindgen_ty_1",
    ][::core::mem::size_of::<bch_dirent__bindgen_ty_1>() - 8usize];
    [
        "Alignment of bch_dirent__bindgen_ty_1",
    ][::core::mem::align_of::<bch_dirent__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: bch_dirent__bindgen_ty_1::d_inum",
    ][::core::mem::offset_of!(bch_dirent__bindgen_ty_1, d_inum) - 0usize];
};
impl Default for bch_dirent__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
pub struct bch_dirent__bindgen_ty_2 {
    pub d_cf_name_block: __BindgenUnionField<bch_dirent__bindgen_ty_2__bindgen_ty_1>,
    pub __bindgen_anon_1: __BindgenUnionField<bch_dirent__bindgen_ty_2__bindgen_ty_2>,
    pub bindgen_union_field: [u8; 6usize],
}
#[repr(C)]
pub struct bch_dirent__bindgen_ty_2__bindgen_ty_1 {
    pub d_pad: __u8,
    pub d_name_len: __le16,
    pub d_cf_name_len: __le16,
    pub d_names: __IncompleteArrayField<__u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_dirent__bindgen_ty_2__bindgen_ty_1",
    ][::core::mem::size_of::<bch_dirent__bindgen_ty_2__bindgen_ty_1>() - 6usize];
    [
        "Alignment of bch_dirent__bindgen_ty_2__bindgen_ty_1",
    ][::core::mem::align_of::<bch_dirent__bindgen_ty_2__bindgen_ty_1>() - 2usize];
    [
        "Offset of field: bch_dirent__bindgen_ty_2__bindgen_ty_1::d_pad",
    ][::core::mem::offset_of!(bch_dirent__bindgen_ty_2__bindgen_ty_1, d_pad) - 0usize];
    [
        "Offset of field: bch_dirent__bindgen_ty_2__bindgen_ty_1::d_name_len",
    ][::core::mem::offset_of!(bch_dirent__bindgen_ty_2__bindgen_ty_1, d_name_len)
        - 2usize];
    [
        "Offset of field: bch_dirent__bindgen_ty_2__bindgen_ty_1::d_cf_name_len",
    ][::core::mem::offset_of!(bch_dirent__bindgen_ty_2__bindgen_ty_1, d_cf_name_len)
        - 4usize];
    [
        "Offset of field: bch_dirent__bindgen_ty_2__bindgen_ty_1::d_names",
    ][::core::mem::offset_of!(bch_dirent__bindgen_ty_2__bindgen_ty_1, d_names) - 6usize];
};
impl Default for bch_dirent__bindgen_ty_2__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_dirent__bindgen_ty_2__bindgen_ty_2 {
    pub __empty_d_name: bch_dirent__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1,
    pub d_name: __IncompleteArrayField<__u8>,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bch_dirent__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1 {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_dirent__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1",
    ][::core::mem::size_of::<bch_dirent__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1>()
        - 0usize];
    [
        "Alignment of bch_dirent__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1",
    ][::core::mem::align_of::<bch_dirent__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1>()
        - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_dirent__bindgen_ty_2__bindgen_ty_2",
    ][::core::mem::size_of::<bch_dirent__bindgen_ty_2__bindgen_ty_2>() - 0usize];
    [
        "Alignment of bch_dirent__bindgen_ty_2__bindgen_ty_2",
    ][::core::mem::align_of::<bch_dirent__bindgen_ty_2__bindgen_ty_2>() - 1usize];
    [
        "Offset of field: bch_dirent__bindgen_ty_2__bindgen_ty_2::__empty_d_name",
    ][::core::mem::offset_of!(bch_dirent__bindgen_ty_2__bindgen_ty_2, __empty_d_name)
        - 0usize];
    [
        "Offset of field: bch_dirent__bindgen_ty_2__bindgen_ty_2::d_name",
    ][::core::mem::offset_of!(bch_dirent__bindgen_ty_2__bindgen_ty_2, d_name) - 0usize];
};
impl Default for bch_dirent__bindgen_ty_2__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_dirent__bindgen_ty_2",
    ][::core::mem::size_of::<bch_dirent__bindgen_ty_2>() - 6usize];
    [
        "Alignment of bch_dirent__bindgen_ty_2",
    ][::core::mem::align_of::<bch_dirent__bindgen_ty_2>() - 1usize];
    [
        "Offset of field: bch_dirent__bindgen_ty_2::d_cf_name_block",
    ][::core::mem::offset_of!(bch_dirent__bindgen_ty_2, d_cf_name_block) - 0usize];
};
impl Default for bch_dirent__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_dirent"][::core::mem::size_of::<bch_dirent>() - 16usize];
    ["Alignment of bch_dirent"][::core::mem::align_of::<bch_dirent>() - 8usize];
    ["Offset of field: bch_dirent::v"][::core::mem::offset_of!(bch_dirent, v) - 0usize];
};
impl Default for bch_dirent {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl bch_dirent {
    #[inline]
    pub fn d_type(&self) -> __u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_d_type(&mut self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn d_type_raw(this: *const Self) -> __u8 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 0usize, 5u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_d_type_raw(this: *mut Self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn d_unused(&self) -> __u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_d_unused(&mut self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn d_unused_raw(this: *const Self) -> __u8 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 5usize, 2u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_d_unused_raw(this: *mut Self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn d_casefold(&self) -> __u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_d_casefold(&mut self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn d_casefold_raw(this: *const Self) -> __u8 {
        unsafe {
            ::core::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::core::ptr::addr_of!((*this)._bitfield_1), 7usize, 1u8)
                    as u8,
            )
        }
    }
    #[inline]
    pub unsafe fn set_d_casefold_raw(this: *mut Self, val: __u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        d_type: __u8,
        d_unused: __u8,
        d_casefold: __u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                5u8,
                {
                    let d_type: u8 = unsafe { ::core::mem::transmute(d_type) };
                    d_type as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                5usize,
                2u8,
                {
                    let d_unused: u8 = unsafe { ::core::mem::transmute(d_unused) };
                    d_unused as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                7usize,
                1u8,
                {
                    let d_casefold: u8 = unsafe { ::core::mem::transmute(d_casefold) };
                    d_casefold as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed(8))]
pub struct bch_inode {
    pub v: bch_val,
    pub bi_hash_seed: __le64,
    pub bi_flags: __le32,
    pub bi_mode: __le16,
    pub fields: __IncompleteArrayField<__u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_inode"][::core::mem::size_of::<bch_inode>() - 16usize];
    ["Alignment of bch_inode"][::core::mem::align_of::<bch_inode>() - 8usize];
    ["Offset of field: bch_inode::v"][::core::mem::offset_of!(bch_inode, v) - 0usize];
    [
        "Offset of field: bch_inode::bi_hash_seed",
    ][::core::mem::offset_of!(bch_inode, bi_hash_seed) - 0usize];
    [
        "Offset of field: bch_inode::bi_flags",
    ][::core::mem::offset_of!(bch_inode, bi_flags) - 8usize];
    [
        "Offset of field: bch_inode::bi_mode",
    ][::core::mem::offset_of!(bch_inode, bi_mode) - 12usize];
    [
        "Offset of field: bch_inode::fields",
    ][::core::mem::offset_of!(bch_inode, fields) - 14usize];
};
impl Default for bch_inode {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_inode_v2 {
    pub v: bch_val,
    pub bi_journal_seq: __le64,
    pub bi_hash_seed: __le64,
    pub bi_flags: __le64,
    pub bi_mode: __le16,
    pub fields: __IncompleteArrayField<__u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_inode_v2"][::core::mem::size_of::<bch_inode_v2>() - 32usize];
    ["Alignment of bch_inode_v2"][::core::mem::align_of::<bch_inode_v2>() - 8usize];
    [
        "Offset of field: bch_inode_v2::v",
    ][::core::mem::offset_of!(bch_inode_v2, v) - 0usize];
    [
        "Offset of field: bch_inode_v2::bi_journal_seq",
    ][::core::mem::offset_of!(bch_inode_v2, bi_journal_seq) - 0usize];
    [
        "Offset of field: bch_inode_v2::bi_hash_seed",
    ][::core::mem::offset_of!(bch_inode_v2, bi_hash_seed) - 8usize];
    [
        "Offset of field: bch_inode_v2::bi_flags",
    ][::core::mem::offset_of!(bch_inode_v2, bi_flags) - 16usize];
    [
        "Offset of field: bch_inode_v2::bi_mode",
    ][::core::mem::offset_of!(bch_inode_v2, bi_mode) - 24usize];
    [
        "Offset of field: bch_inode_v2::fields",
    ][::core::mem::offset_of!(bch_inode_v2, fields) - 26usize];
};
impl Default for bch_inode_v2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_inode_v3 {
    pub v: bch_val,
    pub bi_journal_seq: __le64,
    pub bi_hash_seed: __le64,
    pub bi_flags: __le64,
    pub bi_sectors: __le64,
    pub bi_size: __le64,
    pub bi_version: __le64,
    pub fields: __IncompleteArrayField<__u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_inode_v3"][::core::mem::size_of::<bch_inode_v3>() - 48usize];
    ["Alignment of bch_inode_v3"][::core::mem::align_of::<bch_inode_v3>() - 8usize];
    [
        "Offset of field: bch_inode_v3::v",
    ][::core::mem::offset_of!(bch_inode_v3, v) - 0usize];
    [
        "Offset of field: bch_inode_v3::bi_journal_seq",
    ][::core::mem::offset_of!(bch_inode_v3, bi_journal_seq) - 0usize];
    [
        "Offset of field: bch_inode_v3::bi_hash_seed",
    ][::core::mem::offset_of!(bch_inode_v3, bi_hash_seed) - 8usize];
    [
        "Offset of field: bch_inode_v3::bi_flags",
    ][::core::mem::offset_of!(bch_inode_v3, bi_flags) - 16usize];
    [
        "Offset of field: bch_inode_v3::bi_sectors",
    ][::core::mem::offset_of!(bch_inode_v3, bi_sectors) - 24usize];
    [
        "Offset of field: bch_inode_v3::bi_size",
    ][::core::mem::offset_of!(bch_inode_v3, bi_size) - 32usize];
    [
        "Offset of field: bch_inode_v3::bi_version",
    ][::core::mem::offset_of!(bch_inode_v3, bi_version) - 40usize];
    [
        "Offset of field: bch_inode_v3::fields",
    ][::core::mem::offset_of!(bch_inode_v3, fields) - 48usize];
};
impl Default for bch_inode_v3 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_inode_generation {
    pub v: bch_val,
    pub bi_generation: __le32,
    pub pad: __le32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_inode_generation",
    ][::core::mem::size_of::<bch_inode_generation>() - 8usize];
    [
        "Alignment of bch_inode_generation",
    ][::core::mem::align_of::<bch_inode_generation>() - 8usize];
    [
        "Offset of field: bch_inode_generation::v",
    ][::core::mem::offset_of!(bch_inode_generation, v) - 0usize];
    [
        "Offset of field: bch_inode_generation::bi_generation",
    ][::core::mem::offset_of!(bch_inode_generation, bi_generation) - 0usize];
    [
        "Offset of field: bch_inode_generation::pad",
    ][::core::mem::offset_of!(bch_inode_generation, pad) - 4usize];
};
impl Default for bch_inode_generation {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum inode_opt_id {
    Inode_opt_data_checksum = 0,
    Inode_opt_compression = 1,
    Inode_opt_project = 2,
    Inode_opt_background_compression = 3,
    Inode_opt_data_replicas = 4,
    Inode_opt_promote_target = 5,
    Inode_opt_foreground_target = 6,
    Inode_opt_background_target = 7,
    Inode_opt_erasure_code = 8,
    Inode_opt_nocow = 9,
    Inode_opt_inodes_32bit = 10,
    Inode_opt_casefold = 11,
    Inode_opt_nr = 12,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_inode_flags {
    BCH_INODE_sync = 1,
    BCH_INODE_immutable = 2,
    BCH_INODE_append = 4,
    BCH_INODE_nodump = 8,
    BCH_INODE_noatime = 16,
    BCH_INODE_i_size_dirty = 32,
    BCH_INODE_i_sectors_dirty = 64,
    BCH_INODE_unlinked = 128,
    BCH_INODE_backptr_untrusted = 256,
    BCH_INODE_has_child_snapshot = 512,
    BCH_INODE_has_case_insensitive = 1024,
    BCH_INODE_31bit_dirent_offset = 2048,
}
#[repr(C)]
pub struct bch_inode_alloc_cursor {
    pub v: bch_val,
    pub bits: __u8,
    pub pad: __u8,
    pub generation: __le32,
    pub idx: __le64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_inode_alloc_cursor",
    ][::core::mem::size_of::<bch_inode_alloc_cursor>() - 16usize];
    [
        "Alignment of bch_inode_alloc_cursor",
    ][::core::mem::align_of::<bch_inode_alloc_cursor>() - 8usize];
    [
        "Offset of field: bch_inode_alloc_cursor::v",
    ][::core::mem::offset_of!(bch_inode_alloc_cursor, v) - 0usize];
    [
        "Offset of field: bch_inode_alloc_cursor::bits",
    ][::core::mem::offset_of!(bch_inode_alloc_cursor, bits) - 0usize];
    [
        "Offset of field: bch_inode_alloc_cursor::pad",
    ][::core::mem::offset_of!(bch_inode_alloc_cursor, pad) - 1usize];
    [
        "Offset of field: bch_inode_alloc_cursor::generation",
    ][::core::mem::offset_of!(bch_inode_alloc_cursor, generation) - 4usize];
    [
        "Offset of field: bch_inode_alloc_cursor::idx",
    ][::core::mem::offset_of!(bch_inode_alloc_cursor, idx) - 8usize];
};
impl Default for bch_inode_alloc_cursor {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_logged_op_truncate {
    pub v: bch_val,
    pub subvol: __le32,
    pub pad: __le32,
    pub inum: __le64,
    pub new_i_size: __le64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_logged_op_truncate",
    ][::core::mem::size_of::<bch_logged_op_truncate>() - 24usize];
    [
        "Alignment of bch_logged_op_truncate",
    ][::core::mem::align_of::<bch_logged_op_truncate>() - 8usize];
    [
        "Offset of field: bch_logged_op_truncate::v",
    ][::core::mem::offset_of!(bch_logged_op_truncate, v) - 0usize];
    [
        "Offset of field: bch_logged_op_truncate::subvol",
    ][::core::mem::offset_of!(bch_logged_op_truncate, subvol) - 0usize];
    [
        "Offset of field: bch_logged_op_truncate::pad",
    ][::core::mem::offset_of!(bch_logged_op_truncate, pad) - 4usize];
    [
        "Offset of field: bch_logged_op_truncate::inum",
    ][::core::mem::offset_of!(bch_logged_op_truncate, inum) - 8usize];
    [
        "Offset of field: bch_logged_op_truncate::new_i_size",
    ][::core::mem::offset_of!(bch_logged_op_truncate, new_i_size) - 16usize];
};
impl Default for bch_logged_op_truncate {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_logged_op_finsert {
    pub v: bch_val,
    pub state: __u8,
    pub pad: [__u8; 3usize],
    pub subvol: __le32,
    pub inum: __le64,
    pub dst_offset: __le64,
    pub src_offset: __le64,
    pub pos: __le64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_logged_op_finsert",
    ][::core::mem::size_of::<bch_logged_op_finsert>() - 40usize];
    [
        "Alignment of bch_logged_op_finsert",
    ][::core::mem::align_of::<bch_logged_op_finsert>() - 8usize];
    [
        "Offset of field: bch_logged_op_finsert::v",
    ][::core::mem::offset_of!(bch_logged_op_finsert, v) - 0usize];
    [
        "Offset of field: bch_logged_op_finsert::state",
    ][::core::mem::offset_of!(bch_logged_op_finsert, state) - 0usize];
    [
        "Offset of field: bch_logged_op_finsert::pad",
    ][::core::mem::offset_of!(bch_logged_op_finsert, pad) - 1usize];
    [
        "Offset of field: bch_logged_op_finsert::subvol",
    ][::core::mem::offset_of!(bch_logged_op_finsert, subvol) - 4usize];
    [
        "Offset of field: bch_logged_op_finsert::inum",
    ][::core::mem::offset_of!(bch_logged_op_finsert, inum) - 8usize];
    [
        "Offset of field: bch_logged_op_finsert::dst_offset",
    ][::core::mem::offset_of!(bch_logged_op_finsert, dst_offset) - 16usize];
    [
        "Offset of field: bch_logged_op_finsert::src_offset",
    ][::core::mem::offset_of!(bch_logged_op_finsert, src_offset) - 24usize];
    [
        "Offset of field: bch_logged_op_finsert::pos",
    ][::core::mem::offset_of!(bch_logged_op_finsert, pos) - 32usize];
};
impl Default for bch_logged_op_finsert {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_logged_op_stripe_update {
    pub v: bch_val,
    pub old_idx: __le64,
    pub new_idx: __le64,
    pub old_blocks_nr: __u8,
    pub old_block_map: [__u8; 16usize],
    pub pad: [__u8; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_logged_op_stripe_update",
    ][::core::mem::size_of::<bch_logged_op_stripe_update>() - 40usize];
    [
        "Alignment of bch_logged_op_stripe_update",
    ][::core::mem::align_of::<bch_logged_op_stripe_update>() - 8usize];
    [
        "Offset of field: bch_logged_op_stripe_update::v",
    ][::core::mem::offset_of!(bch_logged_op_stripe_update, v) - 0usize];
    [
        "Offset of field: bch_logged_op_stripe_update::old_idx",
    ][::core::mem::offset_of!(bch_logged_op_stripe_update, old_idx) - 0usize];
    [
        "Offset of field: bch_logged_op_stripe_update::new_idx",
    ][::core::mem::offset_of!(bch_logged_op_stripe_update, new_idx) - 8usize];
    [
        "Offset of field: bch_logged_op_stripe_update::old_blocks_nr",
    ][::core::mem::offset_of!(bch_logged_op_stripe_update, old_blocks_nr) - 16usize];
    [
        "Offset of field: bch_logged_op_stripe_update::old_block_map",
    ][::core::mem::offset_of!(bch_logged_op_stripe_update, old_block_map) - 17usize];
    [
        "Offset of field: bch_logged_op_stripe_update::pad",
    ][::core::mem::offset_of!(bch_logged_op_stripe_update, pad) - 33usize];
};
impl Default for bch_logged_op_stripe_update {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_quota_counter {
    pub hardlimit: __le64,
    pub softlimit: __le64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_quota_counter"][::core::mem::size_of::<bch_quota_counter>() - 16usize];
    [
        "Alignment of bch_quota_counter",
    ][::core::mem::align_of::<bch_quota_counter>() - 8usize];
    [
        "Offset of field: bch_quota_counter::hardlimit",
    ][::core::mem::offset_of!(bch_quota_counter, hardlimit) - 0usize];
    [
        "Offset of field: bch_quota_counter::softlimit",
    ][::core::mem::offset_of!(bch_quota_counter, softlimit) - 8usize];
};
impl Default for bch_quota_counter {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_quota {
    pub v: bch_val,
    pub c: [bch_quota_counter; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_quota"][::core::mem::size_of::<bch_quota>() - 32usize];
    ["Alignment of bch_quota"][::core::mem::align_of::<bch_quota>() - 8usize];
    ["Offset of field: bch_quota::v"][::core::mem::offset_of!(bch_quota, v) - 0usize];
    ["Offset of field: bch_quota::c"][::core::mem::offset_of!(bch_quota, c) - 0usize];
};
impl Default for bch_quota {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_sb_quota_counter {
    pub timelimit: __le32,
    pub warnlimit: __le32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_sb_quota_counter",
    ][::core::mem::size_of::<bch_sb_quota_counter>() - 8usize];
    [
        "Alignment of bch_sb_quota_counter",
    ][::core::mem::align_of::<bch_sb_quota_counter>() - 4usize];
    [
        "Offset of field: bch_sb_quota_counter::timelimit",
    ][::core::mem::offset_of!(bch_sb_quota_counter, timelimit) - 0usize];
    [
        "Offset of field: bch_sb_quota_counter::warnlimit",
    ][::core::mem::offset_of!(bch_sb_quota_counter, warnlimit) - 4usize];
};
impl Default for bch_sb_quota_counter {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_sb_quota_type {
    pub flags: __le64,
    pub c: [bch_sb_quota_counter; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_sb_quota_type"][::core::mem::size_of::<bch_sb_quota_type>() - 24usize];
    [
        "Alignment of bch_sb_quota_type",
    ][::core::mem::align_of::<bch_sb_quota_type>() - 8usize];
    [
        "Offset of field: bch_sb_quota_type::flags",
    ][::core::mem::offset_of!(bch_sb_quota_type, flags) - 0usize];
    [
        "Offset of field: bch_sb_quota_type::c",
    ][::core::mem::offset_of!(bch_sb_quota_type, c) - 8usize];
};
impl Default for bch_sb_quota_type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_sb_field_quota {
    pub field: bch_sb_field,
    pub q: [bch_sb_quota_type; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_sb_field_quota",
    ][::core::mem::size_of::<bch_sb_field_quota>() - 80usize];
    [
        "Alignment of bch_sb_field_quota",
    ][::core::mem::align_of::<bch_sb_field_quota>() - 8usize];
    [
        "Offset of field: bch_sb_field_quota::field",
    ][::core::mem::offset_of!(bch_sb_field_quota, field) - 0usize];
    [
        "Offset of field: bch_sb_field_quota::q",
    ][::core::mem::offset_of!(bch_sb_field_quota, q) - 8usize];
};
impl Default for bch_sb_field_quota {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(8))]
pub struct bch_xattr {
    pub v: bch_val,
    pub x_type: __u8,
    pub x_name_len: __u8,
    pub x_val_len: __le16,
    pub x_name_and_value: __IncompleteArrayField<__u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bch_xattr"][::core::mem::size_of::<bch_xattr>() - 8usize];
    ["Alignment of bch_xattr"][::core::mem::align_of::<bch_xattr>() - 8usize];
    ["Offset of field: bch_xattr::v"][::core::mem::offset_of!(bch_xattr, v) - 0usize];
    [
        "Offset of field: bch_xattr::x_type",
    ][::core::mem::offset_of!(bch_xattr, x_type) - 0usize];
    [
        "Offset of field: bch_xattr::x_name_len",
    ][::core::mem::offset_of!(bch_xattr, x_name_len) - 1usize];
    [
        "Offset of field: bch_xattr::x_val_len",
    ][::core::mem::offset_of!(bch_xattr, x_val_len) - 2usize];
    [
        "Offset of field: bch_xattr::x_name_and_value",
    ][::core::mem::offset_of!(bch_xattr, x_name_and_value) - 4usize];
};
impl Default for bch_xattr {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_recovery_pass {
    BCH_RECOVERY_PASS_recovery_pass_empty = 0,
    BCH_RECOVERY_PASS_scan_for_btree_nodes = 1,
    BCH_RECOVERY_PASS_check_topology = 2,
    BCH_RECOVERY_PASS_accounting_read = 3,
    BCH_RECOVERY_PASS_alloc_read = 4,
    BCH_RECOVERY_PASS_stripes_read = 5,
    BCH_RECOVERY_PASS_initialize_subvolumes = 6,
    BCH_RECOVERY_PASS_snapshots_read = 7,
    BCH_RECOVERY_PASS_check_allocations = 8,
    BCH_RECOVERY_PASS_trans_mark_dev_sbs = 9,
    BCH_RECOVERY_PASS_fs_journal_alloc = 10,
    BCH_RECOVERY_PASS_set_may_go_rw = 11,
    BCH_RECOVERY_PASS_journal_replay = 12,
    BCH_RECOVERY_PASS_merge_btree_nodes = 13,
    BCH_RECOVERY_PASS_presplit_shard_boundaries = 14,
    BCH_RECOVERY_PASS_check_alloc_info = 15,
    BCH_RECOVERY_PASS_check_lrus = 16,
    BCH_RECOVERY_PASS_check_btree_backpointers = 17,
    BCH_RECOVERY_PASS_check_backpointers_to_extents = 18,
    BCH_RECOVERY_PASS_check_extents_to_backpointers = 19,
    BCH_RECOVERY_PASS_check_alloc_to_lru_refs = 20,
    BCH_RECOVERY_PASS_fs_freespace_init = 21,
    BCH_RECOVERY_PASS_bucket_gens_init = 22,
    BCH_RECOVERY_PASS_reconstruct_snapshots = 23,
    BCH_RECOVERY_PASS_delete_dead_interior_snapshots = 24,
    BCH_RECOVERY_PASS_check_snapshot_trees = 25,
    BCH_RECOVERY_PASS_check_snapshots = 26,
    BCH_RECOVERY_PASS_check_subvols = 27,
    BCH_RECOVERY_PASS_check_subvol_children = 28,
    BCH_RECOVERY_PASS_delete_dead_snapshots = 29,
    BCH_RECOVERY_PASS_fs_upgrade_for_subvolumes = 30,
    BCH_RECOVERY_PASS_check_inodes = 31,
    BCH_RECOVERY_PASS_check_extents = 32,
    BCH_RECOVERY_PASS_check_indirect_extents = 33,
    BCH_RECOVERY_PASS_check_dirents = 34,
    BCH_RECOVERY_PASS_check_xattrs = 35,
    BCH_RECOVERY_PASS_check_root = 36,
    BCH_RECOVERY_PASS_check_unreachable_inodes = 37,
    BCH_RECOVERY_PASS_check_subvolume_structure = 38,
    BCH_RECOVERY_PASS_check_directory_structure = 39,
    BCH_RECOVERY_PASS_check_nlinks = 40,
    BCH_RECOVERY_PASS_check_reconcile_work = 41,
    BCH_RECOVERY_PASS_resume_logged_ops = 42,
    BCH_RECOVERY_PASS_delete_dead_inodes = 43,
    BCH_RECOVERY_PASS_kill_i_generation_keys = 44,
    BCH_RECOVERY_PASS_fix_reflink_p = 45,
    BCH_RECOVERY_PASS_set_fs_needs_reconcile = 46,
    BCH_RECOVERY_PASS_btree_bitmap_gc = 47,
    BCH_RECOVERY_PASS_lookup_root_inode = 48,
    BCH_RECOVERY_PASS_NR = 49,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_recovery_pass_stable {
    BCH_RECOVERY_PASS_STABLE_recovery_pass_empty = 41,
    BCH_RECOVERY_PASS_STABLE_scan_for_btree_nodes = 37,
    BCH_RECOVERY_PASS_STABLE_check_topology = 4,
    BCH_RECOVERY_PASS_STABLE_accounting_read = 39,
    BCH_RECOVERY_PASS_STABLE_alloc_read = 0,
    BCH_RECOVERY_PASS_STABLE_stripes_read = 1,
    BCH_RECOVERY_PASS_STABLE_initialize_subvolumes = 2,
    BCH_RECOVERY_PASS_STABLE_snapshots_read = 3,
    BCH_RECOVERY_PASS_STABLE_check_allocations = 5,
    BCH_RECOVERY_PASS_STABLE_trans_mark_dev_sbs = 6,
    BCH_RECOVERY_PASS_STABLE_fs_journal_alloc = 7,
    BCH_RECOVERY_PASS_STABLE_set_may_go_rw = 8,
    BCH_RECOVERY_PASS_STABLE_journal_replay = 9,
    BCH_RECOVERY_PASS_STABLE_merge_btree_nodes = 45,
    BCH_RECOVERY_PASS_STABLE_presplit_shard_boundaries = 48,
    BCH_RECOVERY_PASS_STABLE_check_alloc_info = 10,
    BCH_RECOVERY_PASS_STABLE_check_lrus = 11,
    BCH_RECOVERY_PASS_STABLE_check_btree_backpointers = 12,
    BCH_RECOVERY_PASS_STABLE_check_backpointers_to_extents = 13,
    BCH_RECOVERY_PASS_STABLE_check_extents_to_backpointers = 14,
    BCH_RECOVERY_PASS_STABLE_check_alloc_to_lru_refs = 15,
    BCH_RECOVERY_PASS_STABLE_fs_freespace_init = 16,
    BCH_RECOVERY_PASS_STABLE_bucket_gens_init = 17,
    BCH_RECOVERY_PASS_STABLE_reconstruct_snapshots = 38,
    BCH_RECOVERY_PASS_STABLE_delete_dead_interior_snapshots = 44,
    BCH_RECOVERY_PASS_STABLE_check_snapshot_trees = 18,
    BCH_RECOVERY_PASS_STABLE_check_snapshots = 19,
    BCH_RECOVERY_PASS_STABLE_check_subvols = 20,
    BCH_RECOVERY_PASS_STABLE_check_subvol_children = 35,
    BCH_RECOVERY_PASS_STABLE_delete_dead_snapshots = 21,
    BCH_RECOVERY_PASS_STABLE_fs_upgrade_for_subvolumes = 22,
    BCH_RECOVERY_PASS_STABLE_check_inodes = 24,
    BCH_RECOVERY_PASS_STABLE_check_extents = 25,
    BCH_RECOVERY_PASS_STABLE_check_indirect_extents = 26,
    BCH_RECOVERY_PASS_STABLE_check_dirents = 27,
    BCH_RECOVERY_PASS_STABLE_check_xattrs = 28,
    BCH_RECOVERY_PASS_STABLE_check_root = 29,
    BCH_RECOVERY_PASS_STABLE_check_unreachable_inodes = 40,
    BCH_RECOVERY_PASS_STABLE_check_subvolume_structure = 36,
    BCH_RECOVERY_PASS_STABLE_check_directory_structure = 30,
    BCH_RECOVERY_PASS_STABLE_check_nlinks = 31,
    BCH_RECOVERY_PASS_STABLE_check_reconcile_work = 43,
    BCH_RECOVERY_PASS_STABLE_resume_logged_ops = 23,
    BCH_RECOVERY_PASS_STABLE_delete_dead_inodes = 32,
    BCH_RECOVERY_PASS_STABLE_kill_i_generation_keys = 47,
    BCH_RECOVERY_PASS_STABLE_fix_reflink_p = 33,
    BCH_RECOVERY_PASS_STABLE_set_fs_needs_reconcile = 34,
    BCH_RECOVERY_PASS_STABLE_btree_bitmap_gc = 46,
    BCH_RECOVERY_PASS_STABLE_lookup_root_inode = 42,
}
#[repr(C)]
pub struct recovery_pass_entry {
    pub last_run: __le64,
    pub last_runtime: __le32,
    pub flags: __le32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of recovery_pass_entry",
    ][::core::mem::size_of::<recovery_pass_entry>() - 16usize];
    [
        "Alignment of recovery_pass_entry",
    ][::core::mem::align_of::<recovery_pass_entry>() - 8usize];
    [
        "Offset of field: recovery_pass_entry::last_run",
    ][::core::mem::offset_of!(recovery_pass_entry, last_run) - 0usize];
    [
        "Offset of field: recovery_pass_entry::last_runtime",
    ][::core::mem::offset_of!(recovery_pass_entry, last_runtime) - 8usize];
    [
        "Offset of field: recovery_pass_entry::flags",
    ][::core::mem::offset_of!(recovery_pass_entry, flags) - 12usize];
};
impl Default for recovery_pass_entry {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const BCH_RECOVERY_PASS_NO_RATELIMIT_OFFSET: ::core::ffi::c_uint = 0;
pub const BCH_RECOVERY_PASS_NO_RATELIMIT_BITS: ::core::ffi::c_uint = 1;
pub const BCH_RECOVERY_PASS_NO_RATELIMIT_MAX: __u32 = 1;
#[repr(C)]
pub struct bch_sb_field_recovery_passes {
    pub field: bch_sb_field,
    pub start: __IncompleteArrayField<recovery_pass_entry>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_sb_field_recovery_passes",
    ][::core::mem::size_of::<bch_sb_field_recovery_passes>() - 8usize];
    [
        "Alignment of bch_sb_field_recovery_passes",
    ][::core::mem::align_of::<bch_sb_field_recovery_passes>() - 8usize];
    [
        "Offset of field: bch_sb_field_recovery_passes::field",
    ][::core::mem::offset_of!(bch_sb_field_recovery_passes, field) - 0usize];
    [
        "Offset of field: bch_sb_field_recovery_passes::start",
    ][::core::mem::offset_of!(bch_sb_field_recovery_passes, start) - 8usize];
};
impl Default for bch_sb_field_recovery_passes {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct journal_seq_blacklist_entry {
    pub start: __le64,
    pub end: __le64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of journal_seq_blacklist_entry",
    ][::core::mem::size_of::<journal_seq_blacklist_entry>() - 16usize];
    [
        "Alignment of journal_seq_blacklist_entry",
    ][::core::mem::align_of::<journal_seq_blacklist_entry>() - 8usize];
    [
        "Offset of field: journal_seq_blacklist_entry::start",
    ][::core::mem::offset_of!(journal_seq_blacklist_entry, start) - 0usize];
    [
        "Offset of field: journal_seq_blacklist_entry::end",
    ][::core::mem::offset_of!(journal_seq_blacklist_entry, end) - 8usize];
};
impl Default for journal_seq_blacklist_entry {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct bch_sb_field_journal_seq_blacklist {
    pub field: bch_sb_field,
    pub start: __IncompleteArrayField<journal_seq_blacklist_entry>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of bch_sb_field_journal_seq_blacklist",
    ][::core::mem::size_of::<bch_sb_field_journal_seq_blacklist>() - 8usize];
    [
        "Alignment of bch_sb_field_journal_seq_blacklist",
    ][::core::mem::align_of::<bch_sb_field_journal_seq_blacklist>() - 8usize];
    [
        "Offset of field: bch_sb_field_journal_seq_blacklist::field",
    ][::core::mem::offset_of!(bch_sb_field_journal_seq_blacklist, field) - 0usize];
    [
        "Offset of field: bch_sb_field_journal_seq_blacklist::start",
    ][::core::mem::offset_of!(bch_sb_field_journal_seq_blacklist, start) - 8usize];
};
impl Default for bch_sb_field_journal_seq_blacklist {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_counters_flags {
    TYPE_COUNTER = 1,
    TYPE_SECTORS = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_persistent_counters {
    BCH_COUNTER_sync_fs = 0,
    BCH_COUNTER_fsync = 1,
    BCH_COUNTER_data_read = 2,
    BCH_COUNTER_data_read_inline = 3,
    BCH_COUNTER_data_read_hole = 4,
    BCH_COUNTER_data_read_promote = 5,
    BCH_COUNTER_data_read_nopromote = 6,
    BCH_COUNTER_data_read_nopromote_may_not = 7,
    BCH_COUNTER_data_read_nopromote_already_promoted = 8,
    BCH_COUNTER_data_read_nopromote_unwritten = 9,
    BCH_COUNTER_data_read_nopromote_congested = 10,
    BCH_COUNTER_data_read_bounce = 11,
    BCH_COUNTER_data_read_split = 12,
    BCH_COUNTER_data_read_reuse_race = 13,
    BCH_COUNTER_data_read_retry = 14,
    BCH_COUNTER_data_read_fail_and_poison = 15,
    BCH_COUNTER_data_read_narrow_crcs = 16,
    BCH_COUNTER_data_read_narrow_crcs_fail = 17,
    BCH_COUNTER_data_write = 18,
    BCH_COUNTER_data_update_pred = 19,
    BCH_COUNTER_data_update = 20,
    BCH_COUNTER_data_update_no_io = 21,
    BCH_COUNTER_data_update_in_flight = 22,
    BCH_COUNTER_data_update_fail = 23,
    BCH_COUNTER_data_update_read = 24,
    BCH_COUNTER_data_update_write = 25,
    BCH_COUNTER_data_update_key = 26,
    BCH_COUNTER_data_update_key_fail = 27,
    BCH_COUNTER_data_update_useless_write_fail = 28,
    BCH_COUNTER_data_update_start_fail_obsolete = 29,
    BCH_COUNTER_data_update_noop_obsolete = 30,
    BCH_COUNTER_reconcile_scan_fs = 31,
    BCH_COUNTER_reconcile_scan_metadata = 32,
    BCH_COUNTER_reconcile_scan_pending = 33,
    BCH_COUNTER_reconcile_scan_stripes = 34,
    BCH_COUNTER_reconcile_scan_device = 35,
    BCH_COUNTER_reconcile_scan_inum = 36,
    BCH_COUNTER_reconcile_clear_scan = 37,
    BCH_COUNTER_reconcile_btree = 38,
    BCH_COUNTER_reconcile_data = 39,
    BCH_COUNTER_reconcile_phys = 40,
    BCH_COUNTER_reconcile_stripe = 41,
    BCH_COUNTER_reconcile_set_pending = 42,
    BCH_COUNTER_evacuate_bucket = 43,
    BCH_COUNTER_stripe_alloc = 44,
    BCH_COUNTER_stripe_create = 45,
    BCH_COUNTER_stripe_reuse = 46,
    BCH_COUNTER_stripe_create_fail = 47,
    BCH_COUNTER_stripe_delete = 48,
    BCH_COUNTER_stripe_update_bucket = 49,
    BCH_COUNTER_stripe_update_extent = 50,
    BCH_COUNTER_stripe_update_extent_fail = 51,
    BCH_COUNTER_stripe_repair_race = 52,
    BCH_COUNTER_copygc = 53,
    BCH_COUNTER_copygc_wait_obsolete = 54,
    BCH_COUNTER_cached_ptr_drop = 55,
    BCH_COUNTER_bucket_invalidate = 56,
    BCH_COUNTER_bucket_discard_worker = 57,
    BCH_COUNTER_bucket_discard_fast_worker = 58,
    BCH_COUNTER_bucket_discard = 59,
    BCH_COUNTER_bucket_discard_fast = 60,
    BCH_COUNTER_bucket_alloc = 61,
    BCH_COUNTER_bucket_alloc_fail = 62,
    BCH_COUNTER_open_bucket_alloc_fail = 63,
    BCH_COUNTER_bucket_alloc_from_stripe = 64,
    BCH_COUNTER_sectors_alloc = 65,
    BCH_COUNTER_bkey_pack_pos_fail = 66,
    BCH_COUNTER_btree_cache_scan = 67,
    BCH_COUNTER_btree_cache_reap = 68,
    BCH_COUNTER_btree_cache_cannibalize = 69,
    BCH_COUNTER_btree_cache_cannibalize_lock = 70,
    BCH_COUNTER_btree_cache_cannibalize_lock_fail = 71,
    BCH_COUNTER_btree_cache_cannibalize_unlock = 72,
    BCH_COUNTER_btree_node_write = 73,
    BCH_COUNTER_btree_node_read = 74,
    BCH_COUNTER_btree_node_compact = 75,
    BCH_COUNTER_btree_node_merge = 76,
    BCH_COUNTER_btree_node_merge_attempt = 77,
    BCH_COUNTER_btree_node_split = 78,
    BCH_COUNTER_btree_node_rewrite = 79,
    BCH_COUNTER_btree_node_alloc = 80,
    BCH_COUNTER_btree_node_free = 81,
    BCH_COUNTER_btree_node_set_root = 82,
    BCH_COUNTER_btree_key_cache_fill = 83,
    BCH_COUNTER_btree_path_relock_fail = 84,
    BCH_COUNTER_btree_path_upgrade_fail = 85,
    BCH_COUNTER_btree_reserve_get_fail = 86,
    BCH_COUNTER_journal_flush = 87,
    BCH_COUNTER_journal_res_get_blocked = 88,
    BCH_COUNTER_journal_full = 89,
    BCH_COUNTER_journal_reclaim_finish = 90,
    BCH_COUNTER_journal_reclaim_start = 91,
    BCH_COUNTER_journal_write = 92,
    BCH_COUNTER_journal_pin_resize = 93,
    BCH_COUNTER_gc_gens_end = 94,
    BCH_COUNTER_gc_gens_start = 95,
    BCH_COUNTER_trans_blocked_journal_reclaim = 96,
    BCH_COUNTER_trans_restart_btree_node_reused = 97,
    BCH_COUNTER_trans_restart_btree_node_split = 98,
    BCH_COUNTER_trans_restart_fault_inject = 99,
    BCH_COUNTER_trans_restart_iter_upgrade = 100,
    BCH_COUNTER_trans_restart_journal_preres_get = 101,
    BCH_COUNTER_trans_restart_journal_reclaim = 102,
    BCH_COUNTER_trans_restart_journal_res_get = 103,
    BCH_COUNTER_trans_restart_key_cache_key_realloced = 104,
    BCH_COUNTER_trans_restart_key_cache_raced = 105,
    BCH_COUNTER_trans_restart_mark_replicas = 106,
    BCH_COUNTER_trans_restart_mem_realloced = 107,
    BCH_COUNTER_trans_restart_memory_allocation_failure = 108,
    BCH_COUNTER_trans_restart_relock = 109,
    BCH_COUNTER_trans_restart_relock_after_fill = 110,
    BCH_COUNTER_trans_restart_relock_key_cache_fill_obsolete = 111,
    BCH_COUNTER_trans_restart_relock_next_node = 112,
    BCH_COUNTER_trans_restart_relock_parent_for_fill_obsolete = 113,
    BCH_COUNTER_trans_restart_relock_path = 114,
    BCH_COUNTER_trans_restart_relock_path_intent = 115,
    BCH_COUNTER_trans_restart_too_many_iters = 116,
    BCH_COUNTER_trans_restart_traverse = 117,
    BCH_COUNTER_trans_restart_upgrade = 118,
    BCH_COUNTER_trans_restart_would_deadlock = 119,
    BCH_COUNTER_trans_restart_would_deadlock_write = 120,
    BCH_COUNTER_trans_restart_injected = 121,
    BCH_COUNTER_trans_restart_key_cache_upgrade = 122,
    BCH_COUNTER_transaction_begin = 123,
    BCH_COUNTER_transaction_commit = 124,
    BCH_COUNTER_write_super = 125,
    BCH_COUNTER_trans_restart_would_deadlock_recursion_limit = 126,
    BCH_COUNTER_trans_restart_deadlock_waitlist_alloc = 127,
    BCH_COUNTER_trans_restart_write_buffer_flush = 128,
    BCH_COUNTER_trans_restart_split_race = 129,
    BCH_COUNTER_write_buffer_flush = 130,
    BCH_COUNTER_write_buffer_flush_slowpath = 131,
    BCH_COUNTER_write_buffer_flush_sync = 132,
    BCH_COUNTER_write_buffer_maybe_flush = 133,
    BCH_COUNTER_accounting_key_to_wb_slowpath = 134,
    BCH_COUNTER_error_throw = 135,
    BCH_COUNTER_NR = 136,
}
unsafe extern "C" {
    pub static bch2_counter_flags: [bch_counters_flags; 136usize];
}
impl bch_persistent_counters_stable {
    pub const BCH_COUNTER_STABLE_NR: bch_persistent_counters_stable = bch_persistent_counters_stable::BCH_COUNTER_STABLE_accounting_key_to_wb_slowpath;
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum bch_persistent_counters_stable {
    BCH_COUNTER_STABLE_sync_fs = 110,
    BCH_COUNTER_STABLE_fsync = 111,
    BCH_COUNTER_STABLE_data_read = 0,
    BCH_COUNTER_STABLE_data_read_inline = 80,
    BCH_COUNTER_STABLE_data_read_hole = 81,
    BCH_COUNTER_STABLE_data_read_promote = 30,
    BCH_COUNTER_STABLE_data_read_nopromote = 85,
    BCH_COUNTER_STABLE_data_read_nopromote_may_not = 86,
    BCH_COUNTER_STABLE_data_read_nopromote_already_promoted = 87,
    BCH_COUNTER_STABLE_data_read_nopromote_unwritten = 88,
    BCH_COUNTER_STABLE_data_read_nopromote_congested = 89,
    BCH_COUNTER_STABLE_data_read_bounce = 31,
    BCH_COUNTER_STABLE_data_read_split = 33,
    BCH_COUNTER_STABLE_data_read_reuse_race = 34,
    BCH_COUNTER_STABLE_data_read_retry = 32,
    BCH_COUNTER_STABLE_data_read_fail_and_poison = 95,
    BCH_COUNTER_STABLE_data_read_narrow_crcs = 97,
    BCH_COUNTER_STABLE_data_read_narrow_crcs_fail = 98,
    BCH_COUNTER_STABLE_data_write = 1,
    BCH_COUNTER_STABLE_data_update_pred = 96,
    BCH_COUNTER_STABLE_data_update = 2,
